import "./Date_lisson_main.css";
export default function Date_lisson_main() {
  return (
    <>
      <div className="container">
        <div className="main_content">
          <div className="level_one">
            <div className="title_level_one">
              <hr />
              <h1>مستويات اللغة اليابانية للمبتدئين 1</h1>
              <p>
                ＊على اعتبار تخصيص درسين في الأسبوع، بحيث تكون مدة كل درس 90
                دقيقة، ولمدة شهرين <br />
                أي 8 دروس لكل مستوى موزعة على 12 ساعة في شهرين <br />
                ＊كل درس من كتاب (مينا نو نيهونغو) يحتاج إلى حصتين درسيتين، حصة
                لدراسة القاعدة والحصة الثانية للتطبيق عليها. <br />
                ＊البدء بدراسة الكانجي اعتبارا من المستوى الرابع، أي بعد 3
                مستويات عبر 6 أشهر من بدء دراسة اللغة وتركيز أحرف الكانا جيدا.{" "}
                <br />
                دراسة 20 حرف كانجي في كل مستوى (5 أحرف أسبوعيا) باعتماد كتاب:{" "}
                <br />
                ＢＡＳＩＣ　ＫＡＮＪＩ　ＢＯＯＫ　基本漢字500　ＶＯＬ．１ <br />
                ＊7 مستويات ضرورية لإنهاء الجزء الأول من كتاب (مينا نو
                نيهونغو1)، يكون الطالب قد درس خلالها 80 جرف كانجي. <br />
              </p>
            </div>
            <div className="content_level_one">
              <ul>
                <li>
                <h3>محتوى المستوى الأول</h3>
                  دراسة حروف الهيراغانا <br />
                  التحيات <br />
                  التعريف عن النفس <br />
                  الأرقام <br />
                  الدرس 1 من كتاب (مينا نو نيهونغو): التعريف عن الاسم والمهنة
                  والانتماء، النفي، صياغة السؤال.
                </li>

                <li>
                <h3>محتوى المستوى الثاني</h3>
                  دراسة حروف الكاتاكانا
                  <br />
                  الدرس 2 من كتاب (مينا نو نيهونغو): أسماء الإشارة، الملكية.{" "}
                  <br />
                  الدرس 3: الإرشاد إلى مكان، أين، البلدان والجنسية. <br />
                  الدرس 4: الوقت، صيغة الحاضر والماضي والنفي من الفعل. <br />
                  الدرس 5: الأفعال يأتي ويذهب ويعود، السؤال باستخدام متى. <br />
                </li>

                <li>
                <h3>محتوى المستوى الثالث</h3>
                  مراجعة لأحرف الكانا <br />
                  الدرس 6: المفعول به، السؤال باستخدام ما وماذا، صيغتي ألا تفعل
                  ودعنا نفعل. <br />
                  الدرس 7: القيام بفعل باستخدام وسيلة معينة، الأفعال يعطي ويأخذ،
                  صيغة قد فعلت كذا أو لم أفعل بعد. <br />
                  الدرس 8: الصفات والسؤال عن صفة شيء ما، الظرفين كثيرا وقليلا
                  ما. <br />
                  الدرس 9: الأفعال التي نستخدم معها ظروف التكرار قليلا وكثيرا
                  مثل يفهم ويكره ويحب وغيرها، صيغة من وإلى، السؤال باستخدام
                  لماذا. <br />
                </li>

                <li>
                <h3>محتوى المستوى الرابع</h3>
                  الدرس 10: صيغة يوجد ولا يوجد للعاقل وغير العاقل، حروف الجر.{" "}
                  <br />
                  الدرس 11: العدد والمعدود، صيغة فقط. <br />
                  الدرس 12: اثبات ونفي الأسماء والصفات، صيغة التفضيل. <br />
                  الدرس 13: صيغة أريد شيء وأريد أن أفعل كذا. <br />
                </li>

                <li>
                <h3>محتوى المستوى الخامس</h3>
                  الدرس 14: صيغة افعل من فضلك، ما رأيك أن نفعل كذا، أنا الآن
                  أقوم بكذا. <br />
                  الدرس 15: صيغة لا بأس أن...، لا يجب أن...، هل تعرف...؟ <br />
                  الدرس 16: ترتيب عدة أفعال أو عدة أسماء في جملة واحدة، صيغة
                  فعلت كذا ثم فعلت كذا، صيفة كيف تفعل كذا...؟ <br />
                  الدرس 17: نفي الفعل حسب المجموعة التي ينتمي إليها، صيغة لا
                  داعي أو لا ضرورة لكذا، صيغة يتوجب عليك كذا. <br />
                </li>

                <li>
                <h3>محتوى المستوى السادس</h3>
                  الدرس 18: صيغة الاستطاعة من الفعل، الهواية، صيغة أفعل كذا قبل
                  فعل كذا. <br />
                  الدرس 19: صيغة سبق لي أن، ترتيب الأفعال دون التقيد بترتيب
                  زمني، صيغة يصبح كذا للعاقل وغير العاقل. <br />
                  الدرس 20: الصيغة العامية <br />
                  الدرس 21: صيغة أعتقد وأظن، صيفة مقول القول، صيغة أليس كذلك،
                  صيغة التنبيه. <br />
                </li>

                <li>
                <h3>محتوى المستوى السابع</h3>
                  الدرس 22: صلة الموصول. <br />
                  الدرس 23: استخدام عندما مع الأفعال والصفات والأسماء. <br />
                  الدرس 24: صيغة يفعل لأجل. <br />
                  الدرس 25: صيغة إذا كان، حتى لو كان. <br />
                </li>
              </ul>
            </div>
          </div>
          <div className="level_two">
            <div className="title_level_two">
              <hr />
              <h1>مستويات اللغة اليابانية للمبتدئين 2</h1>
              <p>
                ＊6 مستويات ضرورية لإنهاء كتاب الجزء الثاني (مينا نو نيهونغو2).{" "}
                <br />
                ＊يتم زيادة عدد أحرف الكانجي المطلوب دراستها إلى 25 حرف في كل
                مستوى (تقريبا 6 أحرف أسبوعيا)، فيكون العدد الإجمالي للأحرف
                المدروسة خلال هذه المستويات 150 حرف كانجي. <br />
                ＊ربما من الأفضل أن نخصص 9 أو 10 حصص للمستوى الثالث عشر،
                لاحتوائه على 5 دروس قواعد وللقيام بمراجعة وتمارين قواعدية عامة
                على الكتاب. <br />
              </p>
            </div>
            <div className="content_level_two">
              <ul>
                <li>
                <h3>محتوى المستوى الثامن</h3>
                  الدرس 26: السببية العامية، الطلب، النصيحة. <br />
                  الدرس 27: صياغة الاستطاعة من ذات الفعل. <br />
                  الدرس 28: جمع فعلين باستخدام بينما، ترتيب عدة أسباب في نفس
                  الجملة، استخدام الصيغتين بالإضافة إلى ولذلك. <br />
                  الدرس 29: التعبير عن حالة شيء عاقل أو غير عاقل، الحاضر التام،
                  الأسف على فعل تم. <br />
                </li>

                <li>
                <h3>محتوى المستوى التاسع</h3>
                  الدرس 30: المبني للمجهول، الحاضر التام لأجل هدف معين، القيام
                  بفعل كتحضير مسبق لهدف معين. <br />
                  الدرس 31: النفي بالعامية، صيفة أفكّر في فعل كذا، أنوي كذا، أنا
                  على موعد مع كذا. <br />
                  الدرس 32: صيغة من الأفضل أن، صبغة ربّما... قد يكون، التوقع
                  المستقبلي. <br />
                  الدرس 33: صيغة الاقتباس، طلب نقل رسالة شفوية إلى شخص. <br />
                </li>

                <li>
                <h3>محتوى المستوى العاشر:</h3>
                  الدرس 34: صيغة كما... تماما، ترتيب أفعال في نفس الجملة
                  باستخدام بعد أن، صيغة النهي. <br />
                  الدرس 35: الصيغة الشرطية باستخدام إذا، سؤال طلب النصيحة، صيغة
                  بقدر كذا فهو كذا. <br />
                  الدرس 36: صيغة لكي أكتسب القدرة على كذا أفعل كذا، سأعمل على
                  أن... <br />
                  الدرس 37: المبني للمجهول من الأفعال، صيغة وفقا لِـ... <br />
                </li>

                <li>
                <h3>محتوى المستوى الحادي عشر</h3>
                  الدرس 38: صيغة من الممتع من الجميل من .... أن تفعل كذا، نسيت
                  فعل كذا. <br />
                  الدرس 39: السبب والنتيجة باستخدام بعض الأدوات أو بإجراء تغيير
                  على الفعل. <br />
                  الدرس 40، صيغة ما إذا كان قد... أو لا، صيغة يمكنك أن... <br />
                  الدرس 41: صيغة يفعل لأجل، افعل لو سمحت، ألا تفعل كذا لأجل.{" "}
                  <br />
                </li>

                <li>
                <h3>محتوى المستوى الثاني عشر</h3>
                  الدرس 42: استخدام لأجل مع الأسماء. <br />
                  الدرس 43: صيغة يبدو أنّ مع الأفعال والصفات والأسماء. <br />
                  الدرس 44: صيغة المبالغة، صيغة من السهل أن ومن الصعب أن. <br />
                  الدرس 45: صيغة في حال، رغم أنّ. <br />
                </li>

                <li>
                <h3>محتوى المستوى الثالث عشر</h3>
                  الدرس 46: صيغة كنت على وشك، قد فعلت توّا، من المؤكد أنّ.{" "}
                  <br />
                  الدرس 47: صيغة وفقا لِـ... يبدو أنّ. <br />
                  الدرس 48: صيغة الإجبار، جعل شخص يقوم بشيء. <br />
                  الدرس 49: صيغة الاحترام. <br />
                  الدرس 50: صيغة التواضع. <br />
                </li>

              </ul>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
