import "./Fees_material.css";
import { useNavigate } from "react-router";
import img_fees from "../../assets/Ai_img/_73a4c5e5-2e9c-40f3-8260-f94d1fb42248.jpg";
import { Link } from "react-router-dom";
import { FaCheck } from "react-icons/fa";

export default function Fees_material() {
  // const navigate = useNavigate();

  // const handleRedirect = () => {
  //   const token = localStorage.getItem("token");

  //   if (token) {
  //     // إذا كان المستخدم مسجل الدخول
  //     navigate("/dashboard");
  //   } else {
  //     // إذا لم يكن مسجل الدخول
  //     navigate("/login");
  //   }
  // };
  const navigate = useNavigate();

  const handleRedirect = () => {
    const token = localStorage.getItem("token");
    if (token) {
      navigate("/Dash_users/:userId");
    } else {
      navigate("/Login_users");
    }
  };
  return (
    <>
      <div className="container">
        <div className="money_lisson mt-5" id="Fees">
          <div className="row academy">
            <div className="col-lg-7">
              <h2 className="fw-bold mt-4">الرسوم:</h2>
              <p>
                في <span className="academySpan">أكاديمية اللغة اليابانية،</span>{" "}
                نؤمن بأن فرصة تعلم اللغة اليابانية يجب أن تكون متاحة للجميع، بغض النظر عن الظروف المالية أو المعيشية. لذلك، لا تسعى الأكاديمية لتحقيق أي ربح مادي، بل تهدف إلى تمكين الطلاب من تعلم اللغة اليابانية بأعلى مستوى من الجودة والإتقان. وتضع أكاديمية اللغة اليابانية أولوياتها في توفير الفرصة لأولئك الذين يجدون صعوبة في الوصول إلى المراكز التعليمية أو الجامعات التي تقوم بتقديم برامج تعليمية متخصصة في اللغة اليابانية حول العالم.
              </p>
            </div>
            <div className="col-lg-5">
              <img className="w-100" src={img_fees} alt="" />
            </div>
            <div className="academy">
              <p>
                وبناءً على هذه الرؤية، يتم تحديد الرسوم الدراسية في{" "}
                <span className="academySpan">أكاديمية اللغة اليابانية</span>{" "}
                بشكل رمزي، بحيث تغطي فقط النفقات الإدارية الأساسية. حيث يعمل المدرسون بشكل شبه تطوعي رغبةً منهم في تعليم اللغة اليابانية لمن يرغب في تعلمها، مما يعكس التزام الأكاديمية بتقديم تعليم عالي الجودة دون أن يكون الهدف من ورائه تحقيق أرباح مادية. حيث تسعى{" "}
                <span className="academySpan">أكاديمية اللغة اليابانية</span>{" "}
                إلى توفير بيئة تعليمية تُمكن الطلاب من التغلب على التحديات التي قد يواجهونها في تعلم اللغة اليابانية، وخاصة لأولئك الذين تمنعهم ظروفهم الشخصية أو المالية من الالتحاق بمراكز أو جامعات لغوية أخرى.

              </p>
              <p>
                وإضافة إلى ذلك، تسعى{" "}
                <span className="academySpan">أكاديمية اللغة اليابانية</span>{" "}
                إلى دعم الطلاب المتميزين من خلال تقديم منح دراسية خاصة. حيث يتم منح الطالب المتفوق في كل مستوى فرصة استكمال دراسته في المستوى الأعلى على نفقة الأكاديمية، ودون الحاجة إلى دفع أي رسوم دراسية إضافية. وهذا يُعد بمثابة تحفيز وتشجيع للطلاب الذين يُظهرون تفوقًا ملحوظًا في تعلم اللغة اليابانية، مما يساعدهم على التقدم في دراستهم وتحقيق طموحاتهم.

              </p>
              <p>
                كما نولي في{" "}
                <span className="academySpan">أكاديمية اللغة اليابانية</span>{" "}
                اهتمامًا خاصًا بالطلاب الذين يعيشون في مناطق النزاعات أو في ظروف صعبة قد تمنعهم من دفع الرسوم الدراسية. لذا فإن الأكاديمية تقوم بتقديم منح دراسية لهذه الفئة من الطلاب، بما يتيح لهم الاستفادة من التعليم دون القلق بشأن التكاليف الدراسية. فنحن نؤمن بأن لكل طالب الحق في الحصول على فرصة لتعلم اللغة اليابانية بغض النظر عن التحديات التي قد تواجهه في حياته اليومية، ونسعى إلى تقديم الدعم الكامل له لتحقيق هذا الهدف.

              </p>
              <p>
                ومن خلال هذه السياسات، تهدف{" "}
                <span className="academySpan">أكاديمية اللغة اليابانية</span>{" "}
                إلى جعل فرصة تعلم اللغة اليابانية متاحةً لأكبر عدد ممكن من الطلاب حول العالم، وتقديم بيئة تعليمية عادلة ومتساوية تساهم في تذليل الصعوبات التي قد تواجههم أثناء دراستهم لهذه اللغة الفريدة.

              </p>
              <p>
                في <span className="academySpan">أكاديمية اللغة اليابانية</span>{" "}
                يتم تحديد نفس الرسوم الدراسية لجميع المستويات، ونعمل على توفير برامج تعليمية متنوعة تلبي مختلف الاحتياجات، مع مراعاة توفير باقات مرنة للطلاب، بحيث يمكن الاختيار بين الاشتراك في كل مستوى على حدى، أو الاشتراك في باقة شاملة لكل المستويات برسوم مخفَّضة.

              </p>
            </div>
          </div>

          <div className="levels_fees">
            <ul>
              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المبتدئ الأساسي (J1)
                </h2>

                <p>
                  سيبدأ الطلاب في هذا المستوى بتعلم أساسيات اللغة اليابانية من الصفر. سيتعلمون الحروف اليابانية الأساسية مثل الهيراغانا والكاتاكانا، بالإضافة إلى النطق الصحيح للأصوات اليابانية. كما سيتمكنون من التعريف بأنفسهم، إلقاء التحيات، وتقديم المعلومات الشخصية البسيطة مثل العمر والمهنة.



                  <br /> <span className="academySpan"> الاهداف: </span>

                  <br /><FaCheck /> تعلم الحروف الأساسية (الهيراغانا والكاتاكانا)


                  <br /><FaCheck />  تعلم كيفية التعريف بالنفس باستخدام جمل اسمية بسيطة


                  <br /><FaCheck />  فهم القواعد النحوية الأساسية مثل تركيب الجمل الاسمية البسيطة


                  <br /><FaCheck />  اكتساب مفردات أساسية تتعلق بالتحيات، العمل، الأنشطة اليومية




                  <br />{" "}
                  <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
             
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المبتدئ المتوسط (J2)
                </h2>

                <p>
                  سيستمر الطلاب في هذا المستوى في تعلم المفردات والجمل الأكثر تعقيدًا. سيتعلمون كيفية طرح الأسئلة واستخدام الأفعال في الزمن الماضي والمستقبل. كما سيكتسبون القدرة على التفاعل بشكل أفضل في المواقف اليومية مثل التسوق أو طلب الطعام في المطاعم، وبالتالي تعزيز قدرة الطلاب على إجراء محادثات بسيطة وفعّالة مع اليابانيين في مواقف الحياة اليومية.


                  <br /> <span className="academySpan"> الاهداف: </span>

                  <br /><FaCheck />  تعلم صيغة الماضي والمستقبل للأفعال

                  <br /><FaCheck />  تعلم كيفية طرح الأسئلة باستخدام أدوات الاستفهام (ما، أين، لماذا، متى)


                  <br /><FaCheck />  توسيع القدرة على فهم المحادثات اليومية البسيطة


                  <br /><FaCheck /> تعلم 40 حرف كانجي قراءةً وكتابةً، بمعدل حرفين في كل حصة دراسية



                  <br />{" "}
                  <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المبتدئ المتقدم (J3)
                </h2>

                <p>
                  يركز هذا المستوى على استخدام لغة أكثر تعقيدًا لتمكين الطلاب من التعبير عن آرائهم وأفكارهم. وسيتعلم الطلاب كيفية التحدث عن رغباتهم واحتمالات حدوث شيء ما. كما سيكتسبون القدرة على وصف الأنشطة اليومية بتفصيل أكبر، وبالتالي تطوير قدرة الطلاب على بناء جمل أكثر تعبيرًا وتنظيمًا، مما يساعدهم في التفاعل بشكل أفضل في محادثات يومية أكثر تعقيدًا.


                  <br /> <span className="academySpan"> الاهداف: </span>
                  <br /><FaCheck /> اكتساب القدرة على التعبير عن الرغبات


                  <br /><FaCheck />  التحدث عن الأنشطة اليومية بتفاصيل دقيقة


                  <br /><FaCheck />  اكتساب القدرة على التعبير عن الاحتمالات


                  <br /><FaCheck />  تعلم 40 حرف كانجي قراءةً وكتابةً، بمعدل حرفين في كل حصة دراسية
                  <br />
                  <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.





                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المبتدئ الاحترافي (J4)
                </h2>

                <p>
                  يهدف هذا المستوى إلى تحسين مهارات الطلاب في استخدام اللغة اليابانية في مواقف أكثر رسمية ومهنية. وسيتعلم الطلاب في هذا المستوى كيفية التحدث بلباقة في البيئات المختلفة، باستخدام التعابير اليابانية الخاصة بالاحترام، وبالتالي تمكين الطلاب من التفاعل مع الآخرين بشكل محترف، والتعامل مع محادثات أطول حول مواضيع مختلفة.

           


                  <br /> <span className="academySpan"> الاهداف: </span>
                  <br /><FaCheck /> تعلم الأسلوب الرسمي والتعابير المهذبة في المحادثة


                  <br /><FaCheck />  استخدام تعابير الاحترام في بيئات مختلفة


                  <br /><FaCheck />  اكتساب القدرة على كتابة رسائل رسمية بسيطة


                  <br /><FaCheck />  تعلم 40 حرف كانجي قراءةً وكتابةً، بمعدل حرفين في كل حصة دراسية



                  <br />    <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>
              <li className="p-4">
                <h2 className="fw-bold text-end">باقة المستويات المبتدئة</h2>

                <p>
                  تغطي هذه الباقة جميع المستويات من (J1) إلى (J4)، وتغطي 120 ساعة دراسية من تعلم اللغة اليابانية. وسيكتسب الطلاب إلمامًا كاملًا بأساسيات اللغة اليابانية بما في ذلك الحروف، والمفردات، والقواعد، مع تعزيز القدرة على التفاعل في مواقف الحياة اليومية والرسمية. وتتيح هذه الباقة للطلاب استكمال المهارات الأساسية للغة اليابانية من خلال دراسة شاملة ومتكاملة، ليصبح الطالب مؤهلًا لاجتياز امتحان المستوى (N5) أو حتى (N4) في اختبار الكفاءة في اللغة اليابانية (JLPT).
                  <br />
                  <br />
                  <span className="academySpan">عدد الساعات الدراسية:</span> 120
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  100,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>
              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتوسط المبتدئ (J5)
                </h2>

                <p>
                  بعد مراجعة شاملة لما تمت دراسته في المستويات المبتدئة، سيبدأ الطلاب في هذا المستوى بتعلم جمل أكثر تعقيدًا، واستخدام أدوات الربط بين الجمل لتكوين جمل أطول. وسيتعلمون كيفية التعبير عن آرائهم بشكل أكثر تفصيلًا وتنظيمًا، مما سيمنحهم القدرة على التحدث حول مواضيع متنوعة بشكل أكثر انسيابية.



                  <br /> <span className="academySpan"> الاهداف: </span>
                  <br /><FaCheck /> استخدام أدوات الربط بين الجمل


                  <br /><FaCheck />  تعلم كيفية التعبير عن الآراء والأفكار الشخصية


                  <br /><FaCheck />  تطوير مهارات الاستماع باستخدام نصوص حوارية متنوعة


                  <br /><FaCheck />  تعلم 60 حرف كانجي قراءةً وكتابةً، بمعدل 3 أحرف في كل حصة دراسية


                  <br />
                  <span className="academySpan">
                    عدد الساعات الدراسية:
                  </span>{" "}
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.


                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتوسط الأساسي (J6)
                </h2>

                <p>
                  سيتم في هذا المستوى تعليم الطلاب كيفية التحدث عن الأهداف المختلفة مثل الأهداف الشخصية، وأسباب اتخاذ قرارات معينة. وسيتعلمون أيضًا كيفية التشبيه في اللغة اليابانية، واستخدام الجمل المركبة للقيام بمقارنات بين الأشياء، وبالتالي تمكين الطلاب من التفاعل بشكل أكثر وضوحًا عند الحديث عن أشياء مثل التفضيلات الشخصية أو القرارات الحياتية.

                  <br /> <span className="academySpan"> الاهداف: </span>
                  <br /><FaCheck /> اكتساب القدرة على التعبير عن الأهداف


                  <br /><FaCheck /> استخدام أساليب التشبيه في اللغة اليابانية


                  <br /><FaCheck /> التحدث عن المواقف الاجتماعية مثل السفر، والدراسة، والعمل


                  <br /><FaCheck /> تعلم 60 حرف كانجي قراءةً وكتابةً، بمعدل 3 أحرف في كل حصة دراسية



                  <br />   <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتوسط المتقدم (J7)
                </h2>

                <p>
                  يركز هذا المستوى على تطوير قدرة الطلاب على التعامل مع المواقف الحياتية المعقدة مثل التعبير عن مشاعرهم، ومناقشة قضايا اجتماعية معقدة. وسيتعلم الطلاب في هذا المستوى كيفية القيام بحوارات حول موضوعات مختلفة مثل السياسة أو الثقافة، وبالتالي إكساب الطلاب القدرة على التعبير عن آرائهم بطلاقة وبشكل أكثر وضوحًا.

                  <br /> <span className="academySpan"> الاهداف: </span>
                  <br /><FaCheck /> التحدث عن المشاعر والأحاسيس الشخصية


                  <br /><FaCheck /> التعبير عن الآراء الشخصية في مواضيع متنوعة


                  <br /><FaCheck /> التعامل مع المواقف المتقدمة في الحياة اليومية


                  <br /><FaCheck /> تعلم 60 حرف كانجي قراءةً وكتابةً، بمعدل 3 أحرف في كل حصة دراسية



                  <br />   <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتوسط الاحترافي (J8)
                </h2>

                <p>
                  يركز هذا المستوى على تحسين المهارات اللغوية في السياقات الاحترافية تمامًا. وسيتعلم الطلاب كيفية التفاوض في المواقف المهنية، واستخدام تعابير متخصصة مثل تلك المستخدمة في الأعمال التجارية، وبالتالي تمكين الطلاب من التعامل بكفاءة مع مواقف تتطلب مستوى عالٍ من اللغة اليابانية في المجالات الأكاديمية أو المهنية.


                  <br /> <span className="academySpan"> الاهداف: </span>
                  <br /><FaCheck /> اكتساب المزيد من المفردات الاختصاصية


                  <br /><FaCheck /> القدرة على إجراء محادثات في مجالات متنوعة


                  <br /><FaCheck /> تطوير مهارات الكتابة الرسمية المهنية والأكاديمية


                  <br /><FaCheck /> تعلم 60 حرف كانجي قراءةً وكتابةً، بمعدل 3 أحرف في كل حصة دراسية



                  <br />    <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">باقة المستويات المتوسطة</h2>

                <p>


                  تغطي هذه الباقة جميع المستويات من (J5) إلى (J8)، وتشمل 120 ساعة دراسية من تعلم اللغة اليابانية. وبالتالي سيتمكن الطلاب من تطوير مهاراتهم في التحدث بشكل أكثر دقة حول مواضيع متنوعة ومعقدة. وسيتعلم الطلاب في هذه المستويات كيفية التعبير عن آرائهم حول القضايا الاجتماعية أو المهنية أو غيرها باستخدام أساليب أكثر وضوحًا. وبعد إتمام دراسة المستويات المتوسطة سيصبح الطلاب مؤهلين لاجتياز امتحان المستوى (N3) أو حتى (N2) في اختبار الكفاءة في اللغة اليابانية (JLPT).


                  <br />
                  <span className="academySpan">عدد الساعات الدراسية:</span> 120
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  100,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتقدم المبتدئ (J9)
                </h2>

                <p>

                  هذا المستوى يركز على تطوير المهارات اللغوية في المواضيع الأكثر تعقيدًا. سيتعلم الطلاب كيفية التعبير عن الأفكار المعقدة باستخدام التراكيب النحوية المتقدمة، والتحدث عن تجاربهم الشخصية بشكل مفصل. الهدف هنا هو تعزيز قدرة الطلاب على التواصل بسهولة في مواضيع الحياة اليومية مثل السفر، العمل، والدراسة.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> التعبير عن التجارب الشخصية باستخدام الجمل المعقدة.


                  <br /><FaCheck /> استخدام التراكيب النحوية المتقدمة مثل الجمل الشرطية.


                  <br /><FaCheck /> التحدث عن الأنشطة الاجتماعية بتفاصيل دقيقة.


                  <br /><FaCheck /> تحسين مهارات الاستماع للمحادثات الطبيعية والمركبة.



                  <br />     <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتقدم المتوسط (J10)
                </h2>

                <p>
                  في هذا المستوى، يتعلم الطلاب كيفية التعامل مع مواضيع ثقافية معقدة بشكل أكثر تعمقًا، مثل النقاشات حول القيم الاجتماعية أو القضايا المعاصرة. سيتمكن الطلاب من التعبير عن آراءهم حول مواضيع ذات طابع نظري أو ثقافي. الهدف هنا هو تقوية قدرة الطلاب على المشاركة في مناقشات فكرية مع متحدثين أصليين للغة اليابانية.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> التحدث عن القضايا الاجتماعية والثقافية المتعمقة.


                  <br /><FaCheck /> التعبير عن الرأي الشخصي حول المواضيع المعقدة.


                  <br /><FaCheck /> استخدام المفردات المتخصصة مثل تلك المتعلقة بالثقافة اليابانية.


                  <br /><FaCheck /> تحسين القدرة على الكتابة حول المواضيع الأكاديمية والثقافية.



                  <br />  <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتقدم الأساسي (J11)
                </h2>

                <p>
                  هذا المستوى يركز على تحسين قدرة الطلاب على التحدث والكتابة بشكل دقيق ومقنع حول مواضيع أكاديمية وأدبية. سيتعلم الطلاب كيفية تقديم العروض والمناقشات باللغة اليابانية بشكل متقن، بالإضافة إلى تحسين قدرتهم على التعبير عن الآراء المعقدة بشكل واضح. الهدف من هذا المستوى هو إعداد الطلاب للمشاركة في مناقشات أكاديمية أو مهنية مع المتحدثين الأصليين للغة.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> تحسين مهارات التحدث والكتابة الأكاديمية.


                  <br /><FaCheck /> تعلم كيفية تقديم العروض باللغة اليابانية.


                  <br /><FaCheck /> التعبير عن الآراء المعقدة حول مواضيع ثقافية وأدبية.


                  <br /><FaCheck /> تحسين مهارات الاستماع للأفكار المتقدمة.



                  <br />    <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى المتقدم الاحترافي (J12)
                </h2>

                <p>
                  يركز هذا المستوى على تعزيز المهارات اللغوية في بيئات العمل الاحترافية المتقدمة. سيتعلم الطلاب كيفية التفاعل مع المتحدثين اليابانيين في سياقات مهنية مثل المؤتمرات أو المفاوضات. الهدف من هذا المستوى هو أن يصبح الطلاب قادرين على التعامل مع بيئات العمل اليابانية بشكل محترف، سواء كان ذلك في التقديمات أو المفاوضات أو الاجتماعات.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> تعلم التفاوض باللغة اليابانية في بيئات العمل.


                  <br /><FaCheck /> تحسين مهارات التقديم في الاجتماعات والمناسبات الرسمية.


                  <br /><FaCheck /> التحدث باستخدام الأسلوب الاحترافي في المحادثات.


                  <br /><FaCheck /> تعلم المفردات المتخصصة في مجالات الأعمال.



                  <br />    <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">باقة المستويات المتقدمة</h2>

                <p>


                  تغطي هذه الباقة المستويات من J9 حتى J12، حيث يتمكن الطلاب من تحسين مهاراتهم في التحدث والكتابة في مواضيع أكاديمية ومهنية معقدة. سيتعلمون كيفية التعبير عن آرائهم في محادثات احترافية وثقافية، مما يعزز قدرتهم على التفاعل مع المجتمع الياباني في سياقات متنوعة ومتقدمة. الهدف من هذه الباقة هو تمكين الطلاب من المشاركة بشكل طليق في محادثات ومناقشات مع المتحدثين الأصليين للغة اليابانية في بيئات أكاديمية أو مهنية.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> تطوير المهارات الاحترافية في العمل والتفاوض.


                  <br /><FaCheck /> تحسين الكتابة الأكاديمية والعروض.


                  <br /><FaCheck /> التعامل مع المواضيع المعقدة في الاجتماعات والمناقشات.


                  <br /><FaCheck /> تعلم المفردات المتقدمة في مجالات الثقافة والأعمال.



                  <br />    <span className="academySpan">عدد الساعات الدراسية:</span>120
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  100,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى الاحترافي المبتدئ (J13)
                </h2>

                <p>
                  يركز هذا المستوى على تعلم أسلوب اللغة اليابانية الاحترافية الموجهة إلى بيئات العمل الدولية. سيتعلم الطلاب كيفية كتابة رسائل الأعمال، والتفاعل مع الزملاء والعملاء في بيئات مهنية. الهدف من هذا المستوى هو أن يكون الطلاب قادرين على التعامل مع مواقف العمل الدولية باستخدام لغة احترافية.



                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> تعلم كتابة رسائل الأعمال والبريد الإلكتروني.


                  <br /><FaCheck /> استخدام التعابير الاحترافية في بيئات العمل.


                  <br /><FaCheck /> تحسين مهارات التفاوض والمحادثات مع الزملاء.


                  <br /><FaCheck /> التفاعل مع العملاء باستخدام لغة مهذبة.



                  <br />    <span className="academySpan">عدد الساعات الدراسية:</span>30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>{" "}
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى الاحترافي المتوسط (J14)
                </h2>

                <p>
                  في هذا المستوى، يتعلم الطلاب كيفية التفاعل بشكل مهني في السياقات اليابانية الدولية. سيتعلمون كيفية إجراء المناقشات المعقدة والتعامل مع القضايا المتعلقة بالعمل الجماعي، والقيادة، وإدارة المشاريع. الهدف هو تعزيز قدرة الطلاب على الانخراط في بيئات العمل الاحترافية وتقديم آرائهم وحلولهم بوضوح.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> المشاركة في المناقشات المهنية حول موضوعات متقدمة.


                  <br /><FaCheck /> تعلم إدارة المشاريع واستخدام اللغة المتعلقة بالقيادة.


                  <br /><FaCheck /> تحسين مهارات الاستماع في سياقات العمل.


                  <br /><FaCheck /> كتابة تقارير ومراسلات احترافية.



                  <br />     <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">
                    الرسوم الدراسية:
                  </span>{" "}
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى الاحترافي الأساسي (J15)
                </h2>

                <p>
                  يركز هذا المستوى على استخدام اللغة اليابانية في السياقات الأكاديمية المتقدمة. سيتعلم الطلاب كيفية كتابة البحوث الأكاديمية، والمشاركة في مناقشات فكرية أكاديمية باستخدام أسلوب دقيق ومهني. الهدف هو أن يصبح الطلاب قادرين على التعبير عن أفكارهم بشكل أكاديمي وعلمي باللغة اليابانية.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> تعلم كيفية كتابة البحوث الأكاديمية.


                  <br /><FaCheck /> التحدث عن المواضيع الأكاديمية والبحث العلمي.


                  <br /><FaCheck /> تحسين مهارات التحدث والكتابة في البيئة الأكاديمية.


                  <br /><FaCheck /> تعلم المفردات الخاصة بالأبحاث والكتابة العلمية.



                  <br />  <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">
                  المستوى الاحترافي المتقدم (J16)
                </h2>

                <p>
                  هذا المستوى يركز على تطوير القدرة على استخدام اللغة اليابانية في البيئات الأكاديمية والمهنية المتقدمة. سيتعلم الطلاب كيفية التحدث عن القضايا المعقدة مثل السياسة أو الاقتصاد، وكيفية كتابة تقارير وتحليلات احترافية. الهدف هنا هو تمكين الطلاب من التعبير عن آرائهم وأفكارهم بوضوح في مواقف أكاديمية أو مهنية معقدة.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> التحدث عن القضايا السياسية والاقتصادية المتقدمة.


                  <br /><FaCheck /> كتابة تحليلات وتقارير احترافية.

                  <br /><FaCheck /> تعلم اللغة المتخصصة في الاقتصاد والسياسة.


                  <br /><FaCheck /> تطوير المهارات البحثية باستخدام اللغة اليابانية.



                  <span className="academySpan">عدد الساعات الدراسية:</span> 30
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br />{" "}
                  <span className="academySpan">
                    عدد الطلاب في كل فصل دراسي:
                  </span>
                  4 طلاب كحد أدنى و10 طلاب كحد أقصى.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  30,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>

              <li className="p-4">
                <h2 className="fw-bold text-end">باقة المستويات الاحترافية</h2>

                <p>

                  تغطي هذه الباقة جميع المستويات من J13 حتى J16، مما يسمح للطلاب بتطوير مهاراتهم في التفاعل مع المجتمع الياباني في بيئات أكاديمية ومهنية متقدمة. سيتعلم الطلاب كيفية التعامل مع موضوعات معقدة ومهام متخصصة في العمل والأبحاث الأكاديمية. الهدف من هذه الباقة هو تمكين الطلاب من المشاركة بفعالية في المحادثات الأكاديمية والمهنية مع المتحدثين الأصليين للغة اليابانية.


                  <br /> <span className="academySpan"> التركيز: </span>
                  <br /><FaCheck /> تحسين مهارات التفاوض والإدارة في البيئات الاحترافية.


                  <br /><FaCheck />تعلم كتابة التقارير الأكاديمية والاحترافية.

                  <br /><FaCheck /> التعامل مع المواضيع المعقدة في السياسة والاقتصاد.


                  <br /><FaCheck /> تحسين مهارات التواصل الأكاديمي مع المتحدثين الأصليين.

                  <span className="academySpan">عدد الساعات الدراسية:</span> 120
                  ساعة دراسية، بمعدل حصتين أسبوعيًا، وساعة ونصف لكل حصة دراسية.
                  <br /> <span className="academySpan">الرسوم الدراسية:</span>
                  100,000 ين ياباني أو ما يعادلها بعملة الدولة التي يقيم فيها
                  الطالب.
                  <br />{" "}
                  <span className="academySpan">
                    التسجيل في هذا المستوى:
                  </span>{" "}
                  يُرجى الضغط <Link to="/Register_account">هنا</Link> للانتقال إلى
                  صفحة التسجيل.
                </p>
              </li>
            </ul>
          </div>

          <div className="How_to_pay academy">
            <h2 className="fw-bold">وسائل الدفع:</h2>
            <div className="means">
              <div className="mean_1" onClick={handleRedirect}></div>
              <div className="mean_2" onClick={handleRedirect}></div>
              <div className="mean_3" onClick={handleRedirect}></div>
              <div className="mean_4" onClick={handleRedirect}></div>
              <div className="mean_5" onClick={handleRedirect}></div>
            </div>
          </div>

          {/* <ul className='mt-5'>
            <li className="right academy item1">رسوم المستوى المبتدئ (N5):</li>
            <li className="right academy item2">الدورة الفردية: 150 دولارًا (8 أسابيع).</li>
            <li className="right academy item3">
              {" "}
              الحزمة الشاملة لجميع مستويات المبتدئين: 400 دولار (3 دورات، N5 +
              N4).
            </li>
            <li className="right academy item4">رسوم المستوى المتوسط (N4):</li>
            <li className="right academy item5">الدورة الفردية: 200 دولارًا (8 أسابيع).</li>
            <li className="right academy item6">
              الحزمة الشاملة لمستويات المتوسط والمتقدم: 600 دولار (4 دورات، N4 +
              N3).
            </li>
            <li className="right academy item7"> رسوم المستويات المتقدمة (N3-N1):</li>
            <li className="right academy item8">المستوى المتقدم (N3): 250 دولارًا لكل دورة (10 أسابيع).</li>
            <li className="right academy item9">
              المستويات المتقدمة جدًا والاحترافية (N2-N1): 300 دولار لكل دورة
              (12 أسبوعًا).
            </li>
          </ul> */}

          <p>
            <ul className="academy p-4">
              <span className="note fw-bold">ملاحظات: </span>
              <li className="text-end">
                عند وصول عدد الطلاب المسجلين في نفس المستوى إلى 11 طالبًا أو
                أكثر، يتم تقسيم الطلاب على فصلين دراسيين أو أكثر، وفقًا لعدد
                الطلاب المسجلين في نفس المستوى.
              </li>
              <li className="text-end">
                تتضمن جميع الرسوم الوصول إلى المواد الدراسية الرقمية، التمارين
                التفاعلية، والدعم المباشر مع الأساتذة.
              </li>
              <li className="text-end">
                لا يمكن استرجاع الرسوم الدراسية بعد بدء الدورة الدراسية.
              </li>
              <li className="text-end">
                يمكن استرجاع 25% من الرسوم الدراسية عند الاشتراك في إحدى باقات
                المستويات الشاملة.
              </li>
            </ul>
          </p>
        </div>
      </div>
    </>
  );
}
