import "./Our_Teachers.css";
import Teacher_1 from "../../assets/Teacher/OIP.jpg";
import Teacher_2 from "../../assets/Teacher/photo_2024-10-30_14-24-02.webp";
import Teacher_3 from '../../assets/Teacher/photo_2024-11-03_14-14-22.jpg'
import Our_Teachers_img from "../../assets/Ai_img/_d0260767-0c90-4923-9381-3f0fb9b206d2.jpg";

export default function Our_Teachers() {
  return (
    <>
      <div className="container   mb-5 Our_Teachers" id="Teachers">
        <div className="academy mb-4 ">

        <h2 className=" fw-bold">أعضاء الهيئة التدريسية</h2>
        <p>
          مزيج من الخبرة والمعرفة العميقة باللغتين والثقافتين العربية
          واليابانية…{" "}
        </p>
        <p>
          نفتخر في أكاديمية اللغة اليابانية بفريق متميز من المدرسين الذين يجمعون
          بين الخبرة والمعرفة العميقة في اللغة والثقافة اليابانية والعربية على
          حد السواء. ويتكون فريق المدرسين من مجموعة متنوعة من الأساتذة، تشمل
          مدرّسين يابانيين يتحدثون اللغة العربية بطلاقة، مما يتيح لطلابنا تجربة
          تعليمية فريدة وشاملة.
        </p>
        <p>
          يتمتع المدرسون في أكاديمية اللغة اليابانية بخلفيات أكاديمية قوية
          وتجارب غنية في تدريس اللغة اليابانية للناطقين بالعربية. ويتميزون بفهم
          عميق للثقافتين اليابانية والعربية، مما يساعدهم في تعليم اللغة
          اليابانية ونقل الثقافة اليابانية لطلاب الأكاديمية بطريقة تفاعلية
          وممتعة. وبفضل معرفتهم المتعمقة بالاختلافات بين اللغتين العربية
          واليابانية، فإنهم يستطيعون تقديم شروحات تناسب احتياجات الطلاب وتساعدهم
          على تخطي التحديات والصعوبات اللغوية الناتجة عن الاختلافات الهيكلية بين
          اللغة الأم واللغة اليابانية. ويستخدم فريق التدريس أساليب تدريس مبتكرة
          تشمل الأنشطة التفاعلية ووسائل التعليم الحديثة، مما يسهم في خلق بيئة
          تعليمية محفزة. ويقومون بتقديم تعليم متميز يشجع على الاستكشاف والتفاعل،
          ويعزز من تجربة الطلاب في تعلم اللغة اليابانية.
        </p>
        <p>
          ونحن في أكاديمية اللغة اليابانية نؤمن بأن فهم اللغة لا يقتصر فقط على
          القواعد والمفردات، بل يتضمن أيضًا التعرف على العادات والتقاليد التي
          تشكل جوهر اللغة وتؤثر فيها بشكل مباشر. ونحرص على أن يكون كل درس مليئًا
          بالمعلومات القيمة والتجارب الثقافية، مما يمنح طلابنا أدوات للتواصل
          الفعّال وفهم أعمق للغة والثقافة. ونحن فخورون بفريقنا المتنوع الذي
          يساهم في تعزيز التفاهم بين الثقافات، ويعمل على بناء جسر ثقافي بين
          العالم العربي واليابان.
        </p>
        </div>
        {/* <img className="w-75 d-flex  m-auto" src={Our_Teachers_img} alt="" /> */}
        <div className="row">
          <div className="col-lg-12">
            <img className="w-100" src={Our_Teachers_img} alt="" />
          </div>

          <div className="col-lg-12">
            <ul>
              <li className="academy position-relative mt-5 mb-5">
                <div className="img_teacher">
                  <h2>الأستاذة يوكو تاناكا:</h2>
                  <img className="face" src={Teacher_1} alt="" />
                </div>
                <p>
                  حاصلة على درجة الماجستير في التعليم من جامعة طوكيو، ومتخصصة في
                  تعليم اللغة اليابانية للأجانب منذ أكثر من 10 سنوات. تُجيد
                  العربية وتعمل مع الطلاب العرب على تطوير مهاراتهم في المحادثة
                  والتواصل الفعّال.
                </p>
              </li>

              <li className="academy position-relative mt-5">
                <h2>
                  الأستاذة ناهد المرعي
                  <span>(أستاذة في أكاديمية اللغة اليابانية)</span>
                </h2>
                <div className="img_teacher">
                  <p>
                    من شغف باللغة اليابانية إلى تحقيق الحلم الأكاديمي… <br />
                    لقد بدأت مسيرتي في دراسة اللغة اليابانية في عام 2009، حيث
                    حصلت على إجازة جامعية من كلية الآداب والعلوم الإنسانية، قسم
                    اللغة اليابانية، في جامعة دمشق. وقد كانت تجربتي الأولى
                    كمُعيدة في قسم اللغة اليابانية خطوةً أساسية لبدء مسيرة
                    أكاديمية هدفها نقل جماليات هذه اللغة وآدابها إلى طلابي.
                    وخلال تلك الفترة، عملت أيضًا كمدرسة للغة اليابانية في المعهد
                    العالي للغات في
                    <br />
                  </p>
                  <img className="face" src={Teacher_2} alt="" />
                </div>

                <p>
                  جامعة دمشق, مما عزز خبرتي وأسهم في تعميق معرفتي بطرق تعليم
                  اللغة اليابانية لغير الناطقين بها. لقد دفعني شغفي بالثقافة
                  اليابانية للسفر إلى اليابان لمواصلة دراستي الأكاديمية، وهناك
                  حصلت على درجة الماجستير في الأدب الياباني من جامعة تسوكوبا في
                  عام 2015. واستكملت طريقي نحو الدكتوراه في الأدب الياباني في
                  نفس الجامعة، حيث حصلت على درجة الدكتوراه في الأدب الياباني في
                  عام 2020. وكانت سنوات الدراسة في اليابان غنيةً بالتحديات
                  والفرص، حيث تعرفت على أعماق الأدب والثقافة اليابانية التي
                  تجاوزت حدود اللغة نفسها، مما زاد من إصراري على العودة إلى
                  الوطن والمساهمة في نقل هذه المعرفة. <br />
                  في الوقت الحالي، أعمل كعضو هيئة تدريسية في جامعة دمشق، وأسعى
                  إلى تقديم تعليم مُثرٍ يلهم الطلاب لفهم وتقدير الثقافة
                  اليابانية. <br />
                  ويشكل عملي في أكاديمية اللغة اليابانية جزءًا أساسيًا من أهدافي
                  المستقبلية، حيث أطمح إلى تأسيس جيل جديد من متعلمي اللغة
                  اليابانية بين الناطقين بالعربية، مع تمكينهم من بناء جسور
                  ثقافية وأكاديمية تربط بين الثقافتين اليابانية والعربية.
                </p>
              </li>

              <li className="academy position-relative mt-5">
                <h2>
                  الأستاذة ميئكو نشيئوتشي
                  {/* <span>
                      (أستاذة في أكاديمية اللغة اليابانية) 
                      </span> */}
                </h2>
                <div className="img_teacher">
                  <p>
                    خبرة يابانية بطلاقة عربية لتجربة تعليمية متميزة… <br />
                    لقد بدأ شغفي باللغة والثقافة العربية منذ وقت مبكر، وأمضيت
                    سنوات في الإقامة والعمل في المنطقة العربية، حيث انغمست في
                    تفاصيل الحياة والثقافة العربية وتعلمت اللغة العربية حتى
                    أتقنتها.
                    <br />
                  </p>
                  <img className="face" src={Teacher_3} alt="" />
                </div>

                <p>
                  وبفضل خلفيتي الغنية التي تجمع بين الثقافة اليابانية العريقة
                  والفهم العميق للثقافة العربية الساحرة، أود بأن أكون جسرًا
                  ثقافيًا حقيقيًا يمكّن الطلاب من اكتساب فهم حقيقي وعميق للغة
                  اليابانية. <br />
                  وكمعلمة للغة اليابانية أسعى إلى جعل تعلم اللغة اليابانية تجربة
                  تفاعلية وشيقة من خلال إستراتيجيات مبتكرة، تقدم محتوى يُعنى
                  بتسهيل فهم أساسيات اللغة، وبناء المهارات اللازمة لاستخدامها في
                  الحياة اليومية والأكاديمية. <br />
                  ولأنني أدرك جيدًا التحديات التي قد تواجه الطلاب العرب في تعلم
                  اللغة اليابانية، فإنني أتبنى أساليب تدريسية متقدمة تربط بين
                  الكلمات والمفاهيم اليابانية ونظيراتها في اللغة العربية، مما
                  يسهم في تعزيز الفهم وبناء ثقة الطلاب في مهاراتهم. <br />
                  وإضافةً إلى شغفي بالتعليم، أمتلك خبرة واسعة في الترجمة بين
                  اللغات اليابانية والعربية والإنجليزية، مما يتيح لي تقديم شرح
                  دقيق وموثوق للمفردات والعبارات بما يتماشى مع السياقات
                  المختلفة، ويمكّن الطلاب من فهم واستيعاب اللغة بطريقة متكاملة.
                  ولأنني أدرك عمق التعابير اليابانية وتعدد معانيها، كما هو الحال
                  في اللغة العربية، فإنني قادرة على تبسيط المفاهيم الصعبة وجعلها
                  في متناول الجميع، مما يجعل من تعليمها تجربة ممتعة، تدمج بين
                  الاحترافية والإلهام. <br />
                  ومن خلال تعليمي للغة اليابانية في أكاديمية اللغة اليابانية
                  أسعى لأن أكون مصدر إلهام حقيقي لكل من يرغب بتعلم هذه اللغة
                  الجميلة، وتعريفهم على ثقافة اليابان وقيمها وعاداتها التي تجعل
                  منها بلدًا فريدًا وساحرًا. <br />
                </p>
              </li>
{/* 
              <li className="academy position-relative mt-5">
                <div className="img_teacher">
                  <h2>الأستاذة ساياكو ناكامورا:</h2>
                  <img className="face" src={Teacher_1} alt="" />
                </div>

                <p>
                  مدرّسة محنكة متخصصة في تطوير مهارات المحادثة والاستماع للطلاب.
                  تقدم ورش عمل عن الثقافة اليابانية وتاريخها.
                </p>
              </li> */}

              <li className="academy position-relative mt-5">
                <h2>
                  الأستاذ خالد سليمان
                  <span>(مدير أكاديمية اللغة اليابانية)</span>
                </h2>
                <div className="img_teacher">
                  <p>
                    من رحلة بين لغتين إلى بناء جسر بين ثقافتين…
                    <br />
                    عندما بدأت رحلتي الأكاديمية في كلية الاقتصاد في جامعة دمشق،
                    كانت اليابان بالنسبة لي مجرد بلد بعيد يقع في أقصى الشرق،
                    وكان كل ما أعرفه عن اللغة اليابانية هي تلك الحروف والكلمات
                    الغريبة التي كانت تظهر في شاشة التلفاز عند مشاهدة (الأنمي)
                    الياباني القادم من ذلك البلد. <br />
                  </p>
                  <img className="face" src={Teacher_1} alt="" />
                </div>

                <p>
                  وفجأة ودون تخطيط مُسبق، التحقت بالمعهد العالي للغات في جامعة
                  دمشق، ومن هناك بدأت خطواتي الأولى في عالم اللغة اليابانية، حيث
                  انفتحت أمامي نافذة إلى عالم مليء بالغرابة والجمال، ووجدت نفسي
                  منجذبًا إلى ذلك العالم البعيد بقوة. <br />
                  ومن هناك حصلت على منحة دراسية لدراسة اللغة اليابانية في جامعة
                  طوكيو للدراسات الأجنبية، حيث أمضيت عامًا في اليابان بين جمال
                  اللغة وأعماق الثقافة، وأدركت أن اللغة هي مفتاح لفهم عميق
                  لمجتمع بأكمله. <br />
                  وبعدها عُدت إلى حيث بدأت، حاملًا معي شغفًا جديدًا، وبدأت عملي
                  مترجمًا في مكتب الوكالة اليابانية للتعاون الدولي (جايكا) في
                  دمشق، حيث عشت تجربة الربط بين لغتين وثقافتين بشكل عملي ومؤثر.
                  وأدركت حينها بأن الترجمة هي فن الوصل، وجسر بين الثقافات
                  والشعوب. فكل كلمة في أي لغة هي فرصة لنسج حوار بين عالمين.{" "}
                  <br />
                  ولم أكتفِ عند ذلك الحد، فقد حملت معي حنينًا إلى ذلك العالم
                  الذي صار جزءًا مني، وقررت العودة إليه مرة أخرى لأكمل دراساتي
                  العليا. وبعد أن تنقلت بين عدة جامعات، وأنهيت دراستي في مرحلتي
                  الماجستير والدكتوراه، أصبحت اليابان لي وطنًا ثانيًا، ليس فقط
                  بالمعنى المكاني، بل بارتباط روحي ومعرفي. <br />
                  واليوم، وأنا أعمل كأستاذ للغة والثقافة العربية في عدة جامعات
                  ومعاهد يابانية، وأقوم بتدريس مهارات الترجمة بين اللغتين
                  العربية واليابانية، أجد نفسي في كل درس أو محاضرة، أقدم أكثر من
                  كلمات، أقدم جسرًا عابرًا للقارات، بين البلاد العربية واليابان.{" "}
                  <br />
                  وفي أكاديمية اللغة اليابانية، أسعى لأن أتابع هذه الرسالة، وأن
                  أنقل رحلتي إلى أشخاص يملكون ذات الشغف، لأمهد لهم طريقًا يربط
                  بين اللغة والثقافة اليابانية، ولأساعدهم في بناء جسورهم الخاصة
                  إلى ثقافة ثرية وجميلة، لعلهم يحملون بدورهم رسائل تقرِّب بين
                  الثقافات، ويكتبون قصصهم الخاصة على طريقهم إلى اليابان. <br />
                </p>
              </li>
            </ul>
          </div>
        </div>
      </div>
    </>
  );
}
