import "./Our_Teachers.css";
import Our_Teachers_img from '../../assets/Ai_img/_d0260767-0c90-4923-9381-3f0fb9b206d2.jpg'
export default function Our_Teachers() {
  return (
    <>
      <div className="container mt-5 mb-5 Our_Teachers" id="Teachers">
        <h2 className="mb-4 fw-bold">التعريف بالأساتذة:</h2>
        <p>
          نفتخر في أكاديمية اللغة اليابانية بفريق متميز من المدرسين المعتمدين
          الذين يجمعون بين الخبرة والمعرفة في اللغة اليابانية والثقافة
          اليابانية:
        </p>
        {/* <img className="w-75 d-flex  m-auto" src={Our_Teachers_img} alt="" /> */}
       <div className="academy">
        <div className="row">
          <div className="col-lg-12">
            <img className="w-100" src={Our_Teachers_img} alt="" />
          </div>
<div className="col-lg-12">

        <ul>
          <li>
            <h2>الأستاذة يوكو تاناكا:</h2>
            <p>
              حاصلة على درجة الماجستير في التعليم من جامعة طوكيو، ومتخصصة في
              تعليم اللغة اليابانية للأجانب منذ أكثر من 10 سنوات. تُجيد العربية
              وتعمل مع الطلاب العرب على تطوير مهاراتهم في المحادثة والتواصل
              الفعّال.
            </p>
          </li>
          <li>
            <h2> الأستاذ محمد السعيد:</h2>
            <p>
              مدرس لغة يابانية معتمد من مؤسسة التعليم الياباني، وله خبرة واسعة
              في تدريس اللغة اليابانية للأعمال والأدب الياباني. يساعد الطلاب على
              فهم الفروق الثقافية بين اليابان والعالم العربي.
            </p>
          </li>
          <li>
            <h2>الأستاذة ساياكو ناكامورا:</h2>
            <p>
              مدرّسة محنكة متخصصة في تطوير مهارات المحادثة والاستماع للطلاب.
              تقدم ورش عمل عن الثقافة اليابانية وتاريخها.
            </p>
          </li>
        </ul>
</div>
        </div>
       </div>
      </div>
    </>
  );
}
