import "./Privacy_sec.css";
import img_privacy from "../../assets/privacy/_cf1366d8-6ddb-44f9-b966-a65d496096f6.jpg";
import informations from '../../assets/privacy/_8448e83a-3c19-4997-b93c-ce4df62dd5ea.jpg'
export default function Privacy_sec() {
  return (
    <>
      <div className="container Privacy mt-4">
        <div className="details_privacy">
          <div className="row academy mb-5">
            <div className="col-lg-8 col-md-6 col-12 text_privacy ">
              <h2 className="mb-3">سياسة الخصوصية</h2>
              <p>
                مرحبًا بكم في موقع أكاديمية اللغة اليابانية. تلتزم الأكاديمية
                بحماية خصوصية مستخدمي الموقع وتضمن حماية المعلومات الشخصية
                الخاصة بكم. تهدف سياسة الخصوصية هذه إلى توضيح كيفية جمع واستخدام
                وحماية المعلومات التي يقوم الطلاب بتقديمها عند استخدامهم
                لموقعنا.
              </p>
            </div>
            <div className="col-lg-4 col-md-6 col-12 img_privacy">
              <img className="m-auto" src={img_privacy} alt="" />
         </div>
         </div>

          <div className="ul_privacy">

            <ul className="academy row mb-5" >
            <div className="col-lg-8">
              <h2>جمع المعلومات الشخصية</h2>
              <p>
                تقوم أكاديمية اللغة اليابانية بجمع المعلومات الشخصية اللازمة
                لتقديم خدماتها التعليمية بشكل فعال، ويشمل ذلك:
              </p>

              <li>
                <span>المعلومات الأساسية: </span>كالاسم الكامل، وتاريخ الميلاد،
                والجنس.
              </li>
              <li>
                <span>معلومات الاتصال: </span>مثل البريد الإلكتروني، ورقم الهاتف.
              </li>
              <li>
                <span>المعلومات التعليمية: </span>مستوى اللغة الحالي، والخلفية
                التعليمية السابقة في اللغة اليابانية إن وجدت.
              </li>
              <li>
                <span>معلومات الحساب: </span>مثل اسم المستخدم وكلمة المرور الخاصة
                بالحساب على الموقع.
              </li>
            </div>
            <div className="col-lg-4 img_privacy">
              <img className="m-auto" src={informations} alt="" />
            </div>
              <p className="mt-3">
                يتم جمع هذه المعلومات بشكل رئيسي عند قيام الطالب بإنشاء حساب
                جديد أو التسجيل في إحدى الدورات التعليمية التي نقدمها.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>استخدام المعلومات الشخصية</h2>
              <p>نستخدم المعلومات الشخصية التي نجمعها للأغراض التالية:</p>

              <li>
                <span>تقديم الخدمات التعليمية: </span>مثل تسجيل الطلاب في
                الدورات، ومتابعة تقدمهم، وتوفير الموارد والدروس التعليمية.
              </li>
              <li>
                <span>تحسين وتطوير الموقع:</span>وذلك من خلال تحليل البيانات
                المتعلقة بتفاعل الطلاب مع الموقع لتحسين تجربة المستخدم.
              </li>
              <li>
                <span>التواصل مع الطلاب: </span>نستخدم بيانات الاتصال للتواصل مع
                الطلاب بشأن مواعيد الدورات، وتحديثات البرامج، والمعلومات المهمة
                المتعلقة بالدورات أو الحسابات.
              </li>
              <li>
                <span>أغراض تسويقية: </span>قد يتم استخدام البريد الإلكتروني
                لإرسال رسائل حول دورات جديدة أو عروض خاصة؛ يمكن للطالب اختيار
                إلغاء الاشتراك في أي وقت.
              </li>
            </ul>
            <ul className="academy mb-5">
              <h2>حماية المعلومات</h2>
              <p>
                نولي أهمية كبيرة لحماية معلوماتكم الشخصية. ونقوم بتطبيق عدة
                إجراءات أمنية وتقنية لضمان الحفاظ على سرية البيانات، بما في ذلك:
              </p>

              <li>
                <span>التشفير:</span>يتم تخزين البيانات الشخصية بشكل مشفر، مما
                يقلل من مخاطر الوصول غير المصرح به.
              </li>
              <li>
                <span>القيود الداخلية: </span>لا يتم السماح بالوصول إلى
                المعلومات الشخصية إلا للموظفين المخولين بذلك، والذين يحتاجون
                إليها لأداء مهامهم.
              </li>
              <li>
                <span>مراجعات الأمان الدورية: </span>نقوم بعمليات تدقيق دورية
                للتأكد من سلامة النظام وتقليل احتمالية تعرضه لأي اختراق.
              </li>
            </ul>
            <ul className="academy mb-5">
              <h2>مشاركة المعلومات</h2>
              <p>
                نلتزم بعدم بيع أو تأجير أو تبادل المعلومات الشخصية للطلاب مع أي
                طرف ثالث، إلا في الحالات التالية:
              </p>
              <li>
                <span>الامتثال للمتطلبات القانونية:</span>قد نكون ملزمين بمشاركة
                بعض المعلومات إذا كانت هناك طلبات قانونية أو استدعاءات قضائية.
              </li>
              <li>
                <span>حماية الحقوق والمصالح: </span>في حالات استثنائية، قد نقوم
                بمشاركة المعلومات عند الحاجة لحماية حقوق الأكاديمية، أو
                المستخدمين، أو للحد من الاحتيال.
              </li>
            </ul>
            <ul className="academy mb-5">
              <h2>حقوق المستخدمين</h2>
              <p>
                نحرص على احترام حقوق المستخدمين فيما يخص معلوماتهم الشخصية.
                لذلك، يتمتع الطلاب بالحقوق التالية:
              </p>

              <li>
                <span>الحق في الوصول: </span>يحق للطلاب طلب الوصول إلى المعلومات
                الشخصية الخاصة بهم التي قمنا بجمعها.
              </li>
              <li>
                <span>الحق في التعديل والتصحيح: </span>إذا كانت هناك معلومات غير
                دقيقة أو تحتاج إلى تحديث، يمكن للطالب طلب تصحيح البيانات.
              </li>
              <li>
                <span>الحق في الحذف:</span>يمكن للطلاب طلب حذف بياناتهم الشخصية
                إذا لم تعد هناك حاجة للاحتفاظ بها لأغراض قانونية أو تشغيلية.
              </li>
              <li>
                <span>الحق في الاعتراض: </span>يحق للطلاب الاعتراض على استخدام
                بياناتهم الشخصية في بعض الحالات، مثل الاستخدامات التسويقية.
              </li>
              <p>
                يمكن للطلاب ممارسة هذه الحقوق عن طريق التواصل معنا عبر البريد
                الإلكتروني info@japaneseacademy.jp، وسنعمل على تلبية الطلبات في
                أقرب وقت ممكن.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>تخزين البيانات ومدة الاحتفاظ بها</h2>
              <p>
                نقوم بتخزين المعلومات الشخصية التي يتم جمعها من الطلاب طوال فترة
                استخدامهم لخدمات الأكاديمية. بمجرد إنهاء الحساب أو طلب حذف
                البيانات، يتم اتخاذ إجراءات لحذف المعلومات أو جعلها غير قابلة
                للتعرف. قد نحتفظ ببعض المعلومات الضرورية لفترة أطول وفقًا
                للمتطلبات القانونية أو لأغراض الأمان الداخلي.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>ملفات تعريف الارتباط (الكوكيز)</h2>
              <p>
                يستخدم موقع أكاديمية اللغة اليابانية ملفات تعريف الارتباط
                (Cookies) لتحسين تجربة المستخدم وتخصيص المحتوى. هذه الملفات هي
                عبارة عن بيانات صغيرة تُخزن على جهاز المستخدم عند زيارته للموقع
                وتساعد في:
              </p>
              <li>
                <span>تذكر تفضيلات المستخدم: </span>لتحسين تجربة التصفح من خلال
                تذكر إعدادات معينة.
              </li>
              <li>
                <span>تحليل البيانات: </span>لمساعدتنا في فهم كيفية استخدام
                الموقع، وبالتالي تحسين جودة الخدمات.
              </li>
              <p>
                يمكن للمستخدم اختيار تعطيل ملفات تعريف الارتباط من إعدادات
                المتصفح، لكن قد يؤثر ذلك على بعض ميزات الموقع.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>الروابط الخارجية</h2>
              <p>
                قد يحتوي موقع أكاديمية اللغة اليابانية على روابط لمواقع خارجية.
                يرجى العلم أننا لسنا مسؤولين عن سياسة الخصوصية أو محتوى تلك
                المواقع، وننصح المستخدمين بقراءة سياسات الخصوصية الخاصة بالمواقع
                الأخرى قبل تقديم أي معلومات شخصية.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>تحديث سياسة الخصوصية</h2>
              <p>
                تحتفظ أكاديمية اللغة اليابانية بالحق في تعديل أو تحديث سياسة
                الخصوصية هذه من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة مع
                تحديد تاريخ آخر تحديث. يُنصح المستخدمون بمراجعة هذه السياسة بشكل
                دوري لضمان موافقتهم على أي تغييرات.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>التواصل معنا</h2>
              <p>
                إذا كان لديكم أي استفسارات أو مخاوف بشأن سياسة الخصوصية، أو إذا
                كنتم ترغبون في ممارسة أي من حقوقكم، يُرجى التواصل معنا عبر
                البريد الإلكتروني:
                <a href="mailto:info@japaneseacademy.jp">
                  info@japaneseacademy.jp
                </a>
              </p>
            </ul>
        </div>
          </div>
      </div>
    </>
  );
}
