import "./Terms.css";
import img_Terms from "../../assets/Terms/_4406e21c-6fff-4238-900e-8718d8d061de.jpg"
import deal_img from "../../assets/Terms/_6c036b6a-95ec-4a89-94cb-7b3657d6a1b6.jpg";
export default function Terms() {
  return (
    <>
      <div className="container Privacy mt-4">
        <div className="details_privacy">
          <div className="row academy mb-5">
            <div className="col-lg-8 col-md-6 col-12 text_privacy ">
              <h2 className="mb-3">شروط الاستخدام</h2>
              <p>
                مرحبًا بكم في موقع أكاديمية اللغة اليابانية، المتخصص في تقديم
                دورات تعليم اللغة اليابانية عبر الإنترنت. باستخدامك لهذا الموقع،
                فإنك توافق على الالتزام بالشروط التالية أدناه. يُرجى قراءة هذه
                الشروط بعناية قبل البدء في استخدام الموقع أو التسجيل في أي من
                الدورات التعليمية.
              </p>
            </div>
            <div className="col-lg-4 col-md-6 col-12 img_privacy">
              <img className="m-auto" src={img_Terms} alt="" />
            </div>
          </div>

          <div className="ul_privacy">
            <ul className="academy row mb-5">
              <div className="col-lg-8">
                <h2>قبول الشروط</h2>
                <p>
                  يُعد استخدام هذا الموقع أو التسجيل للحصول على خدمات الأكاديمية
                  موافقة صريحة على الالتزام بشروط الاستخدام وسياسة الخصوصية. في
                  حال عدم الموافقة على هذه الشروط، يُرجى الامتناع عن استخدام
                  الموقع.
                </p>
              </div>
              <div className="col-lg-4 img_privacy">
                <img className="m-auto" src={deal_img} alt="" />
              </div>
              <p className="mt-3">
                يتم جمع هذه المعلومات بشكل رئيسي عند قيام الطالب بإنشاء حساب
                جديد أو التسجيل في إحدى الدورات التعليمية التي نقدمها.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>إنشاء الحساب</h2>
              <p>
                للاستفادة من خدمات الأكاديمية، يُطلب من جميع الطلاب إنشاء حساب
                شخصي يتضمن معلومات مثل الاسم، وتاريخ الميلاد، والبريد
                الإلكتروني، ورقم الهاتف. ويتحمل المستخدم مسؤولية دقة المعلومات
                المقدمة، ويلتزم بتحديثها في حال حدوث أي تغيير.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>الاستخدام المسموح به</h2>
              <p>
                يوافق المستخدم على استخدام الموقع لأغراض تعليمية فقط، ويتعهد بما
                يلي:{" "}
              </p>

              <li>
                عدم استخدام الموقع أو أي من محتوياته لأغراض غير قانونية أو تنتهك
                حقوق الملكية الفكرية.
              </li>
              <li>
                الامتناع عن تحميل أو نشر أي محتوى ضار، أو فيروسات، أو برامج تهدف
                إلى التأثير سلبًا على تشغيل الموقع.
              </li>
              <li>
                عدم محاولة الوصول غير المصرح به إلى أنظمة الأكاديمية، أو
                الحسابات الأخرى.{" "}
              </li>
            </ul>
            <ul className="academy mb-5">
              <h2>حماية الحساب</h2>
              <p>
                يجب على المستخدم الحفاظ على سرية معلومات الدخول الخاصة به (اسم
                المستخدم وكلمة المرور). والأكاديمية غير مسؤولة عن أي استخدام غير
                مصرح به للحساب الشخصي الناتج عن عدم الحفاظ على سرية معلومات
                الدخول.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>الحقوق الفكرية</h2>
              <p>
              جميع المحتويات الموجودة على الموقع، بما في ذلك النصوص، والصور، والفيديوهات، والمحتوى التعليمي، هي ملك لأكاديمية اللغة اليابانية. ويُمنع منعًا باتًّا نسخ أو إعادة إنتاج أو توزيع أي محتوى دون الحصول على إذن خطي مسبق من الأكاديمية.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>سياسة الدفع والاسترداد</h2>
              <p>
              يُرجى مراجعة سياسة الرسوم والاسترداد الخاصة بالدورات التعليمية قبل التسجيل. يتم عرض الأسعار وشروط الدفع بشكل واضح، ولا يمكن استرداد الرسوم إلا وفقًا للسياسة التي تحددها الأكاديمية.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>التغييرات في الدورات أو الخدمات</h2>
              <p>
              تحتفظ أكاديمية اللغة اليابانية بالحق في تعديل أو إلغاء أي من الدورات أو الخدمات المقدمة عبر الموقع في أي وقت، دون الحاجة إلى إشعار مسبق. وستبذل الأكاديمية جهودًا لإعلام المستخدمين في حال وجود تغييرات كبيرة قد تؤثر على تجربتهم التعليمية في الأكاديمية.
              </p>
            
            </ul>
    
            <ul className="academy mb-5">
              <h2>إخلاء المسؤولية</h2>
              <p>
              تبذل الأكاديمية جهدها لتقديم محتوى تعليمي عالي الجودة، لكنها لا تضمن خلو الموقع أو الدورات من الأخطاء أو الأعطال التقنية. كما أن الأكاديمية غير مسؤولة عن أي أضرار مباشرة أو غير مباشرة قد تحدث نتيجة استخدام الموقع.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>الروابط الخارجية</h2>
              <p>
              قد يحتوي الموقع على روابط لمواقع أخرى. والأكاديمية ليست مسؤولة عن المحتوى أو سياسة الخصوصية الخاصة بهذه المواقع الخارجية، ويجب على المستخدم مراجعة شروط الاستخدام وسياسة الخصوصية الخاصة بتلك المواقع قبل استخدامها.
              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>التعديلات على الشروط</h2>
              <p>
              تحتفظ أكاديمية اللغة اليابانية بحقها في تعديل شروط الاستخدام هذه في أي وقت. وسيتم نشر التعديلات على هذه الصفحة مع تاريخ التحديث. يُنصح المستخدمون بمراجعة الشروط بشكل دوري لضمان فهمهم لأي تحديثات قد تطرأ.              </p>
            </ul>
            <ul className="academy mb-5">
              <h2>التواصل</h2>
              <p>
              في حال وجود أي استفسارات أو مشاكل تتعلق بشروط الاستخدام، يُرجى التواصل معنا عبر البريد الإلكتروني:
                <a href="mailto:info@japaneseacademy.jp">
                  info@japaneseacademy.jp
                </a>
                <p>باستخدامك لموقع أكاديمية اللغة اليابانية، فإنك توافق على الالتزام بجميع الشروط الواردة أعلاه.</p>
              </p>
            </ul>
          </div>
        </div>
      </div>
    </>
  );
}
