// import "./Date_lisson_Header.css";
// import img_lisson from "../../assets/Ai_img/_9bf252b1-f72c-4ab3-b8d4-f9dbd6ba947f.jpg";
// import { useNavigate } from "react-router";
// export default function Date_lisson_Header() {
//   const navigate = useNavigate();

//   const handleRedirect = () => {
//     const token = localStorage.getItem("token");
//     if (token) {
//       navigate("/Dash_users/:userId");
//     } else {
//       navigate("/Login_users");
//     }
//   };
//   return (
//     <>
//       <div className="container Date_lisson_Header mt-5" id="Level_division">
//         <div className="row academy">
//           <div className="col-lg-7">
//             <h2 className="title_Date_lisson_Header fw-bold">
//               المستويات الدراسية
//             </h2>

//             <div className="details  mt-3">
//               تقدم أكاديمية اللغة اليابانية برنامجًا دراسيًا متكاملًا لتعلم
//               اللغة اليابانية، ومصمم خصيصًا للناطقين بالعربية. ينقسم البرنامج
//               إلى عدة مستويات تعليمية تبدأ من الأساسيات وحتى الوصول إلى الطلاقة
//               اللغوية، لتلبية احتياجات المتعلمين المختلفين. ويهدف هذا التقسيم
//               إلى تمكين الطلاب من تطوير مهاراتهم اللغوية بشكل متدرج ومنظم، بحيث
//               يتمكنون من فهم اللغة اليابانية واستخدامها بشكل عملي وفعّال. وتنقسم
//               المستويات الدراسية في أكاديميتنا إلى المستويات التالية.
//             </div>
//           </div>
//           <div className="col-lg-5">
//             <img className="w-100" src={img_lisson} alt="" />
//           </div>
//         </div>
//         <div className="All_level">
//           <ul>
//             <li className="academy mb-4 mt-4">
//               <h2>1. المستويات الأساسية</h2>
//               <p>
//                 المستويات الأساسية هي الخطوة الأولى للطلاب الذين ليس لديهم خلفية
//                 عن اللغة اليابانية. وفي هذه المستويات، يتعلم الطلاب الأبجدية
//                 اليابانية الأساسية (الهيراغانا والكاتاكانا)، وأساسيات النطق،
//                 وقواعد اللغة الأساسية، مما يضعهم على طريق فهم الجمل البسيطة
//                 والتعبيرات اليومية. ويتم التركيز على بناء قاعدة قوية تشمل كلمات
//                 وجمل بسيطة، إلى جانب تطوير مهارات الاستماع والنطق لتسهيل عملية
//                 الانتقال إلى المستويات التالية.
//               </p>
//             </li>

//             <li className="academy mb-4">
//               <h2>2. المستويات المتوسطة</h2>
//               <p>
//                 بمجرد إتمام المستويات الأساسية، ينتقل الطلاب إلى المستويات
//                 المتوسطة حيث يصبحون قادرين على بناء جمل أكثر تعقيدًا واستخدام
//                 تراكيب لغوية متنوعة. وفي هذه المرحلة، يتعلم الطلاب مجموعة واسعة
//                 من المفردات والقواعد النحوية التي تساعدهم على التفاعل في مواقف
//                 الحياة اليومية والتواصل بثقة في بيئات غير مألوفة. كما يتم
//                 التركيز على تطوير مهارات القراءة وفهم النصوص اليابانية البسيطة
//                 وحتى المتوسطة.
//               </p>
//             </li>

//             <li className="academy mb-4">
//               <h2>3. المستويات المتقدمة</h2>
//               <p>
//                 عند الوصول إلى المستويات المتقدمة، يكتسب الطلاب القدرة على فهم
//                 واستخدام اللغة اليابانية في سياقات أكثر تعقيدًا، سواء في
//                 المحادثات أو في قراءة النصوص المكتوبة. ويتم التركيز في هذه
//                 المستويات على صقل المهارات اللغوية من خلال التعرف على تراكيب
//                 لغوية معقدة وتوسيع المفردات بما يشمل مصطلحات تقنية وثقافية.
//                 وتهدف المستويات المتقدمة إلى تأهيل الطلاب للتفاعل بطلاقة في
//                 بيئات واقعية، سواء في مجال العمل أو الدراسة أو حتى السياحة.
//               </p>
//             </li>

//             <li className="academy mb-4">
//               <h2>4. المستوى الاحترافي</h2>
//               <p>
//                 هذا المستوى مخصص للطلاب الذين يرغبون في استخدام اللغة اليابانية
//                 على مستوى احترافي. وفي هذا المستوى، يتلقى الطلاب تدريبًا معمقًا
//                 في المجالات الأكاديمية والمهنية، مع التركيز على فهم النصوص
//                 المعقدة والكتابة بشكل احترافي. ويتميز هذا المستوى بتعلم مصطلحات
//                 متقدمة وتراكيب لغوية دقيقة تُستخدم في العمل الأكاديمي والمهني،
//                 مما يمكن الطلاب من التفوق في مجالات مثل الترجمة، والبحث العلمي،
//                 والتواصل في بيئات العمل اليابانية.
//               </p>
//             </li>
//             <hr />
//           <p className="single">
//           كل مستوى يتضمن دراسة شاملة تغطي مهارات القراءة، الكتابة، الاستماع، والمحادثة، مع التوجيه الدقيق من فريق من المدرسين المحترفين، مما يساعد الطلاب على التقدم وفقًا لقدراتهم واحتياجاتهم الخاصة.
// .

//           </p>
//           </ul>
//           <hr />
//         </div>
//         <div className="levels mt-5">
//           <ul className="right">
//             <h2 className="fw-bold mt-4">المستوى المبتدئ (N5):</h2>
//             <p>
//               في هذا المستوى، ستركز على أساسيات اللغة اليابانية، بما في ذلك تعلم
//               حروف الهيراغانا والكاتاكانا، وبعض الكانجي الأساسية. سيتم تقديمك
//               أيضًا لمفردات الحياة اليومية، مثل الأرقام، التحيات، والألوان، مما
//               يساعدك على بناء أساس قوي.
//               <br />
//               المحتوى يشمل:
//             </p>
//             <li> 100 مفردة يابانية أساسية.</li>
//             <li>تدريبات على النطق السليم.</li>
//             <li>قواعد الجملة الأساسية (فعل، فاعل، مفعول).</li>
//             <li>جلسات حوار بسيطة (مع تطبيقات عملية).</li>
//             <button onClick={handleRedirect}>اشترك الآن</button>
//           </ul>
//           <ul className="top">
//             <h2 className="fw-bold mt-4">المستوى المتوسط (N4):</h2>
// <p>
//   هنا تتوسع في قواعد اللغة وتتعمق في تعلم حروف الكانجي الأكثر
//   تعقيدًا. ستتعلم تكوين جمل أكثر تعقيدًا وستبدأ في استخدام اللغة في
//   مواقف حقيقية مثل التحدث عن العائلة، العمل، والهوايات.
//   <br />
//   المحتوى يشمل:
// </p>
// <li> 300 مفردة يابانية إضافية.</li>
// <li> كتابة وقراءة نصوص قصيرة.</li>
// <li>تدريبات على فهم النصوص (استماع وقراءة).</li>
// <li>تدريبات تفاعلية على الحوار اليومي.</li>
//             <button onClick={handleRedirect}>اشترك الآن</button>
//           </ul>
//           <ul className="left">
//             <h2 className="fw-bold mt-4">المستوى المتقدم (N3):</h2>
// <p>
//   في هذا المستوى، يتم التركيز على تطوير مهارات الاستماع والقراءة
//   بشكل أكبر، مما يساعدك على التعامل مع نصوص ومحادثات أكثر تعقيدًا.
//   ستتمكن من التواصل في مواضيع أكثر تنوعًا مثل السياسة، الأعمال،
//   والثقافة اليابانية.
//   <br />
//   المحتوى يشمل:
// </p>
// <li>600 مفردة جديدة.</li>
// <li> كتابة مقالات قصيرة باللغة اليابانية.</li>
// <li>قراءة نصوص إخبارية وقصص يابانية.</li>
// <li>جلسات نقاش مفتوحة.</li>
//             <button onClick={handleRedirect}>اشترك الآن</button>
//           </ul>
//           <ul className="hidden">
//             <h2 className="fw-bold mt-4"> المستوى المتقدم جدًا (N2):</h2>
// <p>
//   يُعد هذا المستوى نقلة نوعية حيث ستركز على المفردات المتخصصة وتطوير
//   قدرتك على التفاعل في بيئات عمل يابانية. ستتعلم كيف تكتب رسائل
//   البريد الإلكتروني، التقارير، وتقديم عروض تقديمية باللغة اليابانية.
//   <br />
//   المحتوى يشمل:
// </p>
// <li> 1000 مفردة متقدمة.</li>
// <li> تحليل نصوص ثقافية وأدبية يابانية.</li>
// <li> محادثات يومية ومهنية مع اليابانيين.</li>
//             <button onClick={handleRedirect}>اشترك الآن</button>
//           </ul>
//           <ul className="hidden">
//             <h2 className="fw-bold mt-4">المستوى الاحترافي (N1):</h2>
// <p>
//   هذا هو مستوى الإتقان، حيث ستتمكن من فهم اللغة اليابانية بشكل شامل
//   واستخدامها بطلاقة في البيئات الأكاديمية والمهنية المعقدة. ستكون
//   قادرًا على قراءة الكتب العلمية والأدبية، كتابة مقالات طويلة،
//   والتحدث في المؤتمرات والندوات.
//   <br />
//   المحتوى يشمل:
// </p>
// <li> 2000 مفردة متقدمة جدًا.</li>
// <li> تدريبات على النقاشات الأكاديمية والمهنية.</li>
// <li> كتابة أبحاث وتقارير احترافية.</li>
// <li> تحليل نصوص أدبية يابانية قديمة وحديثة.</li>
//             <button onClick={handleRedirect}>اشترك الآن</button>
//           </ul>
//         </div>
//       </div>
//     </>
//   );
// }

import "./Date_lisson_Header.css";
import img_lisson from "../../assets/Ai_img/_9bf252b1-f72c-4ab3-b8d4-f9dbd6ba947f.jpg";
import { useNavigate } from "react-router";
import axios from "axios";

export default function Date_lisson_Header() {
  const navigate = useNavigate();

  const handleRedirect = async (Level) => {
    const token = localStorage.getItem("token");
    const id = localStorage.getItem("userId"); // جلب id من localStorage

    if (token && id) {
      try {
        // إرسال طلب لتحديث المستوى في قاعدة البيانات
        const response = await axios.put(
          "http://localhost:3000/api/update-level",
          {
            id, // استخدام id الذي تم جلبه من localStorage
            Level,
          },
          {
            headers: {
              Authorization: token,
            },
          }
        );

        // تحقق من محتوى الاستجابة
        console.log(response); // تحقق من شكل الاستجابة
        if (response && response.data) {
          alert(`تم تسجيلك في ${Level} بنجاح!`); // تأكد من أن الرسالة هي في response.data.message
        } else {
          alert("حدث خطأ في استلام البيانات.");
        }
      } catch (error) {
        console.error("خطأ:", error);
        if (error.response && error.response.status === 401) {
          navigate("/Login_users");
        } else {
          alert("حدث خطأ أثناء التحديث");
        }
      }
    } else {
      navigate("/Login_users");
    }
  };

  return (
    <div className="container Date_lisson_Header mt-5" id="Level_division">
      <div className="row academy">
        <div className="col-lg-7">
          <h2 className="title_Date_lisson_Header fw-bold">
            المستويات الدراسية
          </h2>
          <div className="details mt-3">
            تقدم أكاديمية اللغة اليابانية برنامجًا دراسيًا متكاملًا لتعلم اللغة
            اليابانية، ومصمم خصيصًا للناطقين بالعربية. ينقسم البرنامج إلى عدة
            مستويات تعليمية تبدأ من الأساسيات وحتى الوصول إلى الطلاقة اللغوية،
            لتلبية احتياجات المتعلمين المختلفين. ويهدف هذا التقسيم إلى تمكين
            الطلاب من تطوير مهاراتهم اللغوية بشكل متدرج ومنظم، بحيث يتمكنون من
            فهم اللغة اليابانية واستخدامها بشكل عملي وفعّال. وتنقسم المستويات
            الدراسية في أكاديميتنا إلى المستويات التالية.
          </div>
        </div>
        <div className="col-lg-5">
          <img className="w-100" src={img_lisson} alt="" />
        </div>
      </div>

      <div className="All_level">
        <ul>
          <li className="academy mb-4 mt-4">
            <h2>1. المستويات الأساسية</h2>
            <p>
              المستويات الأساسية هي الخطوة الأولى للطلاب الذين ليس لديهم خلفية
              عن اللغة اليابانية. وفي هذه المستويات، يتعلم الطلاب الأبجدية
              اليابانية الأساسية (الهيراغانا والكاتاكانا)، وأساسيات النطق،
              وقواعد اللغة الأساسية، مما يضعهم على طريق فهم الجمل البسيطة
              والتعبيرات اليومية. ويتم التركيز على بناء قاعدة قوية تشمل كلمات
              وجمل بسيطة، إلى جانب تطوير مهارات الاستماع والنطق لتسهيل عملية
              الانتقال إلى المستويات التالية.
            </p>
          </li>

          <li className="academy mb-4">
            <h2>2. المستويات المتوسطة</h2>
            <p>
              بمجرد إتمام المستويات الأساسية، ينتقل الطلاب إلى المستويات
              المتوسطة حيث يصبحون قادرين على بناء جمل أكثر تعقيدًا واستخدام
              تراكيب لغوية متنوعة. وفي هذه المرحلة، يتعلم الطلاب مجموعة واسعة من
              المفردات والقواعد النحوية التي تساعدهم على التفاعل في مواقف الحياة
              اليومية والتواصل بثقة في بيئات غير مألوفة. كما يتم التركيز على
              تطوير مهارات القراءة وفهم النصوص اليابانية البسيطة وحتى المتوسطة.
            </p>
          </li>

          <li className="academy mb-4">
            <h2>3. المستويات المتقدمة</h2>
            <p>
              عند الوصول إلى المستويات المتقدمة، يكتسب الطلاب القدرة على فهم
              واستخدام اللغة اليابانية في سياقات أكثر تعقيدًا، سواء في المحادثات
              أو في قراءة النصوص المكتوبة. ويتم التركيز في هذه المستويات على صقل
              المهارات اللغوية من خلال التعرف على تراكيب لغوية معقدة وتوسيع
              المفردات بما يشمل مصطلحات تقنية وثقافية. وتهدف المستويات المتقدمة
              إلى تأهيل الطلاب للتفاعل بطلاقة في بيئات واقعية، سواء في مجال
              العمل أو الدراسة أو حتى السياحة.
            </p>
          </li>

          <li className="academy mb-4">
            <h2>4. المستوى الاحترافي</h2>
            <p>
              هذا المستوى مخصص للطلاب الذين يرغبون في استخدام اللغة اليابانية
              على مستوى احترافي. وفي هذا المستوى، يتلقى الطلاب تدريبًا معمقًا في
              المجالات الأكاديمية والمهنية، مع التركيز على فهم النصوص المعقدة
              والكتابة بشكل احترافي. ويتميز هذا المستوى بتعلم مصطلحات متقدمة
              وتراكيب لغوية دقيقة تُستخدم في العمل الأكاديمي والمهني، مما يمكن
              الطلاب من التفوق في مجالات مثل الترجمة، والبحث العلمي، والتواصل في
              بيئات العمل اليابانية.
            </p>
          </li>
          <hr />
          <p className="single">
            كل مستوى يتضمن دراسة شاملة تغطي مهارات القراءة، الكتابة، الاستماع،
            والمحادثة، مع التوجيه الدقيق من فريق من المدرسين المحترفين، مما
            يساعد الطلاب على التقدم وفقًا لقدراتهم واحتياجاتهم الخاصة.
          </p>
        </ul>
        <hr />
      </div>

      <div className="levels mt-5">
        <ul className="right">
          <h2 className="fw-bold mt-4">المستوى المبتدئ (N5):</h2>
          <p>
            في هذا المستوى، ستركز على أساسيات اللغة اليابانية، بما في ذلك تعلم
            حروف الهيراغانا والكاتاكانا، وبعض الكانجي الأساسية. سيتم تقديمك
            أيضًا لمفردات الحياة اليومية، مثل الأرقام، التحيات، والألوان، مما
            يساعدك على بناء أساس قوي.
            <br />
            المحتوى يشمل:
          </p>
          <li> 100 مفردة يابانية أساسية.</li>
          <li>تدريبات على النطق السليم.</li>
          <li>قواعد الجملة الأساسية (فعل، فاعل، مفعول).</li>
          <li>جلسات حوار بسيطة (مع تطبيقات عملية).</li>
          <button onClick={() => handleRedirect("المستوى المبتدئ (N5)")}>
            اشترك الآن
          </button>
        </ul>
        <ul className="top">
          <h2 className="fw-bold mt-4">المستوى المتوسط (N4):</h2>
          <p>
            هنا تتوسع في قواعد اللغة وتتعمق في تعلم حروف الكانجي الأكثر تعقيدًا.
            ستتعلم تكوين جمل أكثر تعقيدًا وستبدأ في استخدام اللغة في مواقف
            حقيقية مثل التحدث عن العائلة، العمل، والهوايات.
            <br />
            المحتوى يشمل:
          </p>
          <li> 300 مفردة يابانية إضافية.</li>
          <li> كتابة وقراءة نصوص قصيرة.</li>
          <li>تدريبات على فهم النصوص (استماع وقراءة).</li>
          <li>تدريبات تفاعلية على الحوار اليومي.</li>
          <button onClick={() => handleRedirect("المستوى المتوسط (N4)")}>
            اشترك الآن
          </button>
        </ul>
        <ul className="left">
          <h2 className="fw-bold mt-4">المستوى المتقدم (N3):</h2>
          <p>
            في هذا المستوى، يتم التركيز على تطوير مهارات الاستماع والقراءة بشكل
            أكبر، مما يساعدك على التعامل مع نصوص ومحادثات أكثر تعقيدًا. ستتمكن
            من التواصل في مواضيع أكثر تنوعًا مثل السياسة، الأعمال، والثقافة
            اليابانية.
            <br />
            المحتوى يشمل:
          </p>
          <li>600 مفردة جديدة.</li>
          <li> كتابة مقالات قصيرة باللغة اليابانية.</li>
          <li>قراءة نصوص إخبارية وقصص يابانية.</li>
          <li>جلسات نقاش مفتوحة.</li>
          <button onClick={() => handleRedirect("المستوى المتقدم (N3)")}>
            اشترك الآن
          </button>
        </ul>
        <ul className="hidden">
          <h2 className="fw-bold mt-4">المستوى المتقدم جدًا (N2):</h2>
          <p>
            يُعد هذا المستوى نقلة نوعية حيث ستركز على المفردات المتخصصة وتطوير
            قدرتك على التفاعل في بيئات عمل يابانية. ستتعلم كيف تكتب رسائل البريد
            الإلكتروني، التقارير، وتقديم عروض تقديمية باللغة اليابانية.
            <br />
            المحتوى يشمل:
          </p>
          <li> 1000 مفردة متقدمة.</li>
          <li> تحليل نصوص ثقافية وأدبية يابانية.</li>
          <li> محادثات يومية ومهنية مع اليابانيين.</li>
          <button onClick={() => handleRedirect("المستوى المتقدم جدًا (N2)")}>
            اشترك الآن
          </button>
        </ul>
        <ul className="hidden">
          <h2 className="fw-bold mt-4">المستوى الاحترافي (N1):</h2>
          <p>
            هذا هو مستوى الإتقان، حيث ستتمكن من فهم اللغة اليابانية بشكل شامل
            واستخدامها بطلاقة في البيئات الأكاديمية والمهنية المعقدة. ستكون
            قادرًا على قراءة الكتب العلمية والأدبية، كتابة مقالات طويلة، والتحدث
            في المؤتمرات والندوات.
            <br />
            المحتوى يشمل:
          </p>
          <li> 2000 مفردة متقدمة جدًا.</li>
          <li> تدريبات على النقاشات الأكاديمية والمهنية.</li>
          <li> كتابة أبحاث وتقارير احترافية.</li>
          <li> تحليل نصوص أدبية يابانية قديمة وحديثة.</li>
          <button onClick={() => handleRedirect("المستوى الاحترافي (N1)")}>
            اشترك الآن
          </button>
        </ul>
      </div>
    </div>
  );
}
