import "./Date_lisson_Header.css";

import img_lisson from "../../assets/Level_div/9bf252b1-f72c-4ab3-b8d4-f9dbd6ba947f.webp";
import img_read from "../../assets/Level_div/f8bcafb4-5b49-4da9-8bb3-92e3f75bce9e.webp";
import img_listen from "../../assets/Level_div/20102b1c-f765-4316-b5ce-f6690c682010.webp";
import img_write from "../../assets/Level_div/621b977e-14ea-4c95-96a0-b4487827a673.webp";
import img_talk from "../../assets/Level_div/a8d31677-60f5-4507-9984-ebdced19d05a.webp";


export default function Date_lisson_Header() {
 
  return (
    <div className="container Date_lisson_Header mt-5" id="Level_division">
      <div className="row academy hidden">
        <div className="col-lg-7">
          <h2 className="title_Date_lisson_Header fw-bold">
            المستويات الدراسية
          </h2>
          <div className="details mt-3">
            تقدم <span className="academySpan"> أكاديمية اللغة اليابانية </span>{" "}
            برنامجًا دراسيًا متكاملًا لتعلم اللغة اليابانية، ومصممًا خصيصًا للناطقين باللغة العربية. وينقسم البرنامج إلى عدة مستويات تعليمية تبدأ من الأساسيات وحتى الوصول إلى الطلاقة اللغوية، لتلبية احتياجات المتعلمين المختلفين. ويهدف هذا التقسيم إلى تمكين الطلاب من تطوير مهاراتهم اللغوية بشكل متدرج ومنظم، بحيث يتمكنون من فهم اللغة اليابانية واستخدامها بشكل عملي وفعّال. وتنقسم المستويات الدراسية في {" "}
            <span className="academySpan"> أكاديمية اللغة اليابانية </span> إلى
            المستويات التالية:
          </div>
        </div>
        <div className="col-lg-5">
          <img className="w-100" src={img_lisson} alt="" />
        </div>
      </div>

      <div className="All_level">
        <ul>
          <li className="academy mb-4 mt-4 left">
            <h2>1. المستويات المبتدئة</h2>
            <p>
              تنقسم المستويات المبتدئة في{" "}
              <span className="academySpan"> أكاديمية اللغة اليابانية </span>{" "}
              إلى ثلاثة مستويات، وهي الخطوة الأولى للطلاب الذين لم يسبق لهم أن تعلموا اللغة اليابانية، أو بدؤوا في تعلمها حديثًا. وفي هذه المستويات، يتعلم الطلاب الأبجدية اليابانية الأساسية (الهيراغانا والكاتاكانا)، وأساسيات النطق، وقواعد اللغة الأساسية، مع بعض حروف الكانجي الأساسية، مما يضعهم على طريق فهم الجمل البسيطة والتعبيرات اليومية. ويتم التركيز على بناء قاعدة قوية، تشمل كلمات وجملًا بسيطة، إلى جانب تطوير مهارات الاستماع والنطق، لتسهيل عملية الانتقال إلى مستويات أعلى. وتنقسم المستويات المبتدئة إلى المستويات الأربعة التالية:

              <br />
              1- المستوى المبتدئ الأساسي(J1)
              <br />
              2- المستوى المبتدئ المتوسط (J2)
              <br />
              3- المستوى المبتدئ المتقدم (J3)
              <br />
              4- المستوى المبتدئ الاحترافي (J4)

            </p>
          </li>

          <li className="academy mb-4 right">
            <h2>2. المستويات المتوسطة</h2>
            <p>
              بمجرد إتمام المستويات المبتدئة، ينتقل طلاب{" "}
              <span className="academySpan"> أكاديمية اللغة اليابانية </span>{" "}
              إلى المستويات المتوسطة، والتي تنقسم بدورها إلى ثلاثة مستويات، حيث يصبحون قادرين على بناء جمل أكثر تعقيدًا، واستخدام تراكيب لغوية متنوعة. وفي هذه المستويات، يتعلم الطلاب مجموعة واسعة من المفردات والتعابير اللغوية التي تساعدهم على التفاعل في مواقف الحياة اليومية، والتواصل بثقة في بيئات غير مألوفة. كما يتم التركيز على تطوير مهارات القراءة وفهم النصوص اليابانية البسيطة وحتى المتوسطة من خلال تعلم المزيد من حروف الكانجي، ليصبح الطلاب قادرين على قراءة وفهم النصوص اليابانية بشكل أفضل. وتنقسم المستويات المتوسطة إلى المستويات الأربعة التالية:

              <br />
              1- المستوى المتوسط المبتدئ (J4)
              <br />
              2- المستوى المتوسط الأساسي (J6)
              <br />
              3- المستوى المتوسط المتقدم (J7)
              <br />
              4- المستوى المتوسط الاحترافي (J8)
            </p>
          </li>

          <li className="academy mb-4 left">
            <h2>3. المستويات المتقدمة</h2>
            <p>
              عند الوصول إلى المستويات المتقدمة، يكتسب الطلاب القدرة على فهم واستخدام اللغة اليابانية في سياقات أكثر تعقيدًا، سواءً في المحادثات أو في قراءة النصوص المكتوبة. وفي
              <span className="academySpan"> أكاديمية اللغة اليابانية </span>{" "}
              يتم التركيز في هذه المستويات على صقل المهارات اللغوية من خلال التعرف على تراكيب لغوية معقدة وتوسيع المفردات بما يشمل مصطلحات تقنية وثقافية. وتهدف
              <span className="academySpan"> أكاديمية اللغة اليابانية </span> في
              في المستويات المتقدمة إلى تأهيل الطلاب للتفاعل بطلاقة في بيئات واقعية، سواءً في مجال العمل أو الدراسة أو حتى النشاطات الترفيهية. وتنقسم المستويات المتقدمة إلى المستويات الأربعة التالية:

              <br />
              1- المستوى المتقدم المبتدئ (J9)
              <br />
              2- المستوى المتقدم المتوسط (J10)
              <br />
              3- المستوى المتقدم الأساسي (J11)
              <br />
              4- المستوى المتقدم الاحترافي (J12)
            </p>
          </li>

          <li className="academy mb-4 right">
            <h2>4. المستويات الاحترافية</h2>
            <p>
              المستويات الاحترافية هي مستويات موجهة للطلاب الذين يسعون لاستخدام اللغة اليابانية بشكل متمكن واحترافي في مجالات متنوعة مثل الأكاديمية والمهنية. وتهدف
              <span className="academySpan"> أكاديمية اللغة اليابانية </span> من
              من خلال هذه المستويات إلى توفير تدريب شامل ومتعمق، وتُركز على اكتساب الطلاب القدرة على التعامل مع نصوص معقدة مثل الأبحاث العلمية، والمقالات المتخصصة، والتقارير المهنية، مما يعزز قدرتهم على فهم واستخدام اللغة اليابانية بشكل يتماشى مع أعلى المعايير اللغوية. وبالإضافة إلى ذلك، تولي
              <span className="academySpan"> أكاديمية اللغة اليابانية </span> في
              في هذه المستويات اهتمامًا خاصًا لتطوير مهارات التواصل في بيئات العمل اليابانية، سواء من خلال المحادثات اليومية أو عبر الكتابة المهنية مثل الرسائل الرسمية والتقارير المهنية، مما يعزز فرص النجاح والتفوق في بيئة عمل احترافية. وتنقسم هذه المستويات إلى المستويات الأربعة التالية:

              <br />
              1- المستوى الاحترافي المبتدئ (J13)

              <br />
              2- المستوى الاحترافي المتوسط (J14)

              <br />
              3- المستوى الاحترافي الأساسي (J15)

              <br />
              4- المستوى الاحترافي المتقدم (J16)

            </p>
          </li>
          <hr />
          <p className="single hidden">
          إن كل مستوى في <span className="academySpan">أكاديمية اللغة اليابانية</span> يتضمن برنامجًا دراسيًا شاملًا يغطي جميع المهارات الأساسية التي يحتاجها الطالب لتعلم اللغة بشكل متكامل. وتشمل هذه المهارات القراءة، والكتابة، والاستماع، والمحادثة، حيث يُعطى كل جانب من هذه المهارات اهتمامًا خاصًا بما يتناسب مع مستوى الطالب وتقدمه. ويتم بناء المنهج بطريقة مرنة بحيث يُمكن للطلاب التقدم حسب قدراتهم الشخصية واحتياجاتهم اللغوية. وتنقسم المهارات اللغوية في أكاديمية اللغة اليابانية إلى المهارات التالية:

          </p>
        </ul>
        <hr />
        <div className="skills All_level">
          <ul>
            <li className="academy row mb-4 left">
              <div className="col-lg-7">
                <p>
                  1. {""}
                  <span className="academySpan">مهارات القراءة:</span> تتضمن
                  مهارات القراءة في{" "}
                  <span className="academySpan">
                    {" "}
                    أكاديمية اللغة اليابانية{" "}
                  </span>{" "}
                  دراسة النصوص اليابانية المتنوعة التي تبدأ من النصوص البسيطة حتى الوصول إلى النصوص المتقدمة والمعقدة. ويتعلم الطلاب في المراحل الأولى كيفية قراءة الحروف الأبجدية اليابانية (الهيراغانا والكاتاكانا)، ثم ينتقلون إلى قراءة الجمل والنصوص القصيرة التي تحتوي على حروف الكانجي. ومع تقدمهم في المستويات الدراسية، يتعلمون المزيد من حروف الكانجي، ويتعاملون مع نصوص أدبية وعلمية تحتوي على مفردات وصيغ لغوية معقدة، مما يساعدهم على تحسين مهارات الفهم والاستيعاب لديهم.

                </p>
              </div>
              <div className="img_skills col-lg-5">
                <img className="w-100" src={img_read} alt="" />
              </div>
            </li>
            <li className="academy row mb-4 right">
              <div className="img_listen col-lg-5">
                <img className="w-100" src={img_write} alt="" />
              </div>
              <div className="col-lg-7">
                <p>
                  2. {""}
                  <span className="academySpan">مهارات الكتابة:</span> تركز{" "}
                  <span className="academySpan">
                    {" "}
                    أكاديمية اللغة اليابانية{" "}
                  </span>{" "}
                  على تطوير قدرة الطلاب على الكتابة بشكل صحيح ودقيق باستخدام الأساليب الأكاديمية والمهنية. ويبدأ الطلاب في كتابة الجمل البسيطة، ثم يتدرجون نحو كتابة المقالات والتقارير الأكاديمية والمهنية. ويتعلمون أيضًا كتابة رسائل رسمية واحترافية تتماشى مع معايير بيئة العمل اليابانية، مما يساعدهم على التفاعل مع بيئات الدراسة والعمل بطرق احترافية.

                </p>
              </div>
            </li>
            <li className="academy row mb-4 left">
              <div className="col-lg-7">
                <p>
                  3. {""}
                  <span className="academySpan">مهارات الاستماع:</span> تُعتبر مهارات الاستماع من أهم الجوانب التي يتم التركيز عليها في جميع المستويات في 
                  <span className="academySpan">
                    {" "}
                    أكاديمية اللغة اليابانية{" "}
                  </span>
                  حيث يبدأ الطلاب في الاستماع إلى محادثات بسيطة باللغة اليابانية، ومن ثم يتدرجون إلى الاستماع إلى حوارات ومحاضرات متقدمة تحتوي على مفردات معقدة وأسلوب لغوي أكاديمي ومهني. ويتم تعزيز مهارات الاستماع من خلال تمارين عملية تساعد الطلاب على فهم التعابير المختلفة، والتعرف على أساليب التحدث في البيئات الأكاديمية والمهنية المختلفة.

                </p>
              </div>
              <div className="img_listen col-lg-5">
                <img className="w-100" src={img_listen} alt="" />
              </div>
            </li>
            <li className="academy row mb-4 right">
              <div className="img_listen col-lg-5">
                <img className="w-100" src={img_talk} alt="" />
              </div>
              <div className="col-lg-7">
                <p>
                  4. {""}
                  <span className="academySpan">مهارات المحادثة:</span> 
                  تُعد مهارات المحادثة من أكثر المهارات أهمية عند تعلم أي لغة أجنبية. وفي
                  <span className="academySpan"> أكاديمية اللغة اليابانية </span>{" "}
                  تتمثل أهمية هذه المهارة في تمكين الطلاب من التواصل بثقة مع الناطقين باللغة اليابانية في مختلف المواقف الحياتية والمهنية. ويتم تدريب الطلاب على التحدث باللغة اليابانية في بيئات متنوعة، سواءً في المحادثات اليومية أو في المناقشات الأكاديمية والمهنية. ويشمل التدريب على تحسين النطق، والقدرة على التعبير عن الأفكار بوضوح وبأسلوب مناسب للمواقف المختلفة.
                </p>
              </div>
            </li>
            <hr />
            <p className="single hidden">
             وكل هذه المهارات يتم تدريسها في <span className="academySpan"> أكاديمية اللغة اليابانية </span> تحت إشراف فريق من المدرسين المتخصصين، يقومون بتقديم التوجيه والدعم المستمر للطلاب، ويقومون بتحديد تقدم الطلاب بناءً على تقييماتهم الفردية، مما يسمح بتحديد المستويات وطرق التدريس المناسبة لاحتياجات كل طالب. ويتعامل المدرسون في أكاديمية اللغة اليابانية مع الطلاب بشكل شخصي، حيث يساعدونهم على تخطي التحديات اللغوية التي قد يواجهونها، مما يضمن تقدمهم في تعلم اللغة اليابانية بطريقة فعّالة وملائمة لمستوى كل منهم على حدى.

            </p>

            <hr />
          </ul>
        </div>
      </div>

    
    </div>
  );
}
