import "./Header.css";
import img_header from "../../assets/Ai_img/_c44c06cf-5421-4193-b9bb-cd39a86e679f.jpg";
import img_what_we_do from "../../assets/imgheader/_dcdcbe88-4c28-4699-bb82-1d2754efe109.jpg";
import img_why_we_choos from "../../assets/imgheader/_993a5416-0b18-4ddb-869a-a5b99532ffe5.jpg";
import vision_img from "../../assets/imgheader/_fa1d11a6-f7f0-49d6-8ba9-5ea0abd69afe.jpg";
import letter_img from "../../assets/imgheader/_9e9b0610-8fca-4c60-8d4d-d734e8182c46.jpg";
import VideoCall from "../VideoCall/VideoCall";
// import learn_img from '../../assets/imgheader/R (1).jpg'
export default function Header() {
  return (
    <>
      <VideoCall />
      <div className="container Header">
        <div className="academy pb-4 pt-4 mt-4 left">
          <div className="row Header_revers">
            <div className="col-lg-6">
              <div className="academy_logo mb-4 ">
                <h2 className=" left fw-bold">أكاديمية اللغة اليابانية</h2>
              </div>
              {/* <h2 className="title_academy mb-3">التعريف بالأكاديمية:</h2> */}
              <div className="details">
                 مرحبًا بكم في
                <span className="academySpan">
              
                {""}  أكاديمية اللغة اليابانية، {""}
                </span>
                المنصة التعليمية الرائدة لتعليم اللغة اليابانية للناطقين بغيرها. في أكاديمية اللغة اليابانية نقدم لكم تجربة تعليمية تفاعلية وفريدة، تمكنكم من تعلم اللغة اليابانية من خلال مجموعة متنوعة من الدروس والأنشطة، مدعومةً بأحدث التقنيات التعليمية وطرق التدريس المتقدمة. وما يميزنا في أكاديميتنا هو فريق التدريس المتعدد الثقافات، والذي يضم ناطقين أصليين باللغتين اليابانية والعربية، مما يوفر لكم تعلمًا ممتعًا وسلسًا يجمع بين الدقة اللغوية والتواصل الثقافي، ونوفر لكم بيئة تعليمية مخصصة تساعدكم على تحقيق أهدافكم اللغوية والثقافية.

              </div>
            </div>
            <div className="col-lg-6">
              <img className="w-100" src={img_header} alt="" />
            </div>
          </div>
        </div>
        <div className="academy mt-5 mb-5 right row">
          <div className="col-lg-6 ">
            <img className="w-100" src={vision_img} alt="" />
          </div>
          <div className="col-lg-6">
            <h2 className="title_academy mb-3">رؤيتنا:</h2>
            <div className="details">
            لقد تأسست                <span className="academySpan"> أكاديمية اللغة اليابانية </span>
            لتكون جسرًا يربط بين العالم العربي واليابان من خلال اللغة والثقافة. فنحن نؤمن أن تعلم اللغة ليس مجرد تعلم القواعد والمفردات واستخدامها للتواصل اللغوي، بل هو نافذة لفهم الثقافات والحضارات المختلفة. ومن هنا، جاءت رؤيتنا في تقديم تعليم شامل يمزج بين التعليم اللغوي والتواصل الثقافي، بحيث يصبح الطلاب قادرين على استخدام اللغة اليابانية بشكل فعال في حياتهم اليومية والعملية. وبناء جسر ثقافي بين العالم العربي واليابان من خلال تعليم اللغة اليابانية بطريقة مبتكرة، ومتدرجة، وشاملة. ونسعى إلى تمكين الطلاب من التواصل بثقة واحترافية باستخدام اللغة اليابانية في مختلف مجالات الحياة، سواء كانت أكاديمية، أو مهنية، أو حتى ترفيهية. وفي أكاديمية اللغة اليابانية نؤمن بأن اللغة ليست مجرد أداة للتواصل، بل هي مفتاح لفهم ثقافات جديدة وتوسيع آفاق التبادل الثقافي والعلمي.
            </div>
          </div>
        </div>

        <div className="academy mt-5 mb-5 right row">
          <div className="col-lg-6 ">
            <h2 className="title_academy mb-3">رسالتنا:</h2>
            <div className="details">
            تتمثل رسالة
            <span className="academySpan"> أكاديمية اللغة اليابانية </span>
            في توفير تعليم لغوي عالي الجودة، يمكِّن جميع المتعلمين من اكتساب اللغة اليابانية بفعالية، مع فهم عميق للثقافة اليابانية. ونهدف في أكاديميتنا إلى أن نصبح وجهة أساسية لكل من يسعى لتعلم اللغة اليابانية في العالم من الناطقين باللغة العربية بشكل خاص. ونحرص على أن يكون التعليم ليس فقط تفاعليًا وممتعًا، بل أيضًا مبنيًا على أسس علمية ولغوية مدروسة، تضمن الفهم العميق والتطبيق السليم للغة. وفي أكاديمية اللغة اليابانية، نؤمن أن إتقان اللغة اليابانية سيفتح أمامكم أبوابًا واسعة من الفرص، سواءً في مجالات العمل، أو الدراسة، أو حتى التواصل الشخصي. وتعلم اللغة اليابانية ليس مجرد اكتساب مهارات جديدة، بل هو رحلة لاكتشاف عالم جديد مليء بالإثارة والتحديات.

            </div>
          </div>
          <div className="col-lg-6">
            <img className="w-100" src={letter_img} alt="" />
          </div>
        </div>

        <div className="what_we_do ">
          <h2 className="fw-bold text-center mb-4">
            ماذا نقدم في أكاديمية اللغة اليابانية؟
          </h2>
          <img
            className="w-75 m-auto d-flex mb-4"
            src={img_what_we_do}
            alt=""
          />
          <ul className="ps-0">
            <li className="academy mb-4">
              <h2>1. دورات تعليمية شاملة: </h2>
              <p>
              تقوم <span className="academySpan"> أكاديمية اللغة اليابانية </span>
              بتقديم دورات تعليمية متنوعة تناسب جميع المستويات، بدءًا من المبتدئين الذين لا يملكون أي معرفة مسبقة باللغة اليابانية، وصولًا إلى المتعلمين المتقدمين الذين يرغبون في تحسين مهاراتهم اللغوية. وتعتمد الدورات على منهجيات تدريس حديثة ومتطورة، تجمع بين التعلم الذاتي والتفاعل المباشر مع المدرسين.

              </p>
            </li>
            <li className="academy mb-4">
              <h2>2. تدريس تفاعلي عبر الإنترنت: </h2>
              <p>
              في <span className="academySpan"> أكاديمية اللغة اليابانية </span>
              نستخدم أحدث الأدوات والمنصات التعليمية لتقديم دروس تفاعلية عبر الإنترنت. حيث يمكن للطلاب الانضمام إلى الحصص الافتراضية من أي مكان في العالم، والمشاركة في نقاشات وأنشطة مباشرة مع معلمين ناطقين أصليين باللغتين اليابانية والعربية، مما يعزز التفاعل والتطبيق الفعلي للغة.
              </p>
            </li>
            <li className="academy mb-4">
              <h2>3. برنامج متكامل للتعلم الثقافي: </h2>
              <p>
              إلى جانب تعليم اللغة اليابانية، نقوم في <span className="academySpan"> أكاديمية اللغة اليابانية </span> بتقديم مواد وأنشطة تساعد على فهم الثقافة والعادات والتقاليد اليابانية. وهذه البرامج الثقافية تعزز من قدرة الطلاب على التواصل بفعالية مع المجتمع الياباني وتفتح لهم آفاقًا أوسع لفهم المجتمع الياباني وثقافته.

              </p>
            </li>
            <li className="academy mb-4">
              <h2>4. أساليب تدريس مبتكرة: </h2>
              <p>
              في <span className="academySpan"> أكاديمية اللغة اليابانية </span>
              نحرص على استخدام أساليب تدريس حديثة تعتمد على التكنولوجيا المتقدمة مثل التعلم التكيُّفي، والألعاب التعليمية، والتطبيقات التفاعلية. وهذه الأساليب تجعل عملية التعلم أكثر متعة وفعالية، وتساعد الطلاب على تحسين مهاراتهم في وقت قصير.

              </p>
            </li>
            <li className="academy mb-4">
              <h2>5. دروس خصوصية وجماعية: </h2>
              <p>
              نقوم في  <span className="academySpan"> أكاديمية اللغة اليابانية </span>

              بتوفير خيارات متعددة من الدروس، سواءً كنت تفضل التعلم ضمن مجموعة أو تحتاج إلى دروس خصوصية مع مدرس متخصص. وتتناسب هذه الخيارات مع احتياجات كل طالب، سواءً كان الهدف هو اكتساب المهارات اللغوية الأساسية أو التحضير للامتحانات الرسمية مثل اختبار الكفاءة في اللغة اليابانية (JLPT) وغيره.

              </p>
            </li>
          </ul>
        </div>
        <div className="why_we_choose">
          <h2 className="fw-bold text-center">
            لماذا تختار أكاديمية اللغة اليابانية؟
          </h2>
          <img
            className="w-75 m-auto d-flex mb-4"
            src={img_why_we_choos}
            alt=""
          />
          <ul className="ps-0">
            <li className="academy mb-4">
              <h2>1. فريق تدريس متخصص:</h2>
              <p>
              يضم فريق <span className="academySpan"> أكاديمية اللغة اليابانية </span>
              مدرِّسين ناطقين أصليين باليابانية، بالإضافة إلى مدرِّسين ناطقين باللغة العربية ذوي خبرة في تعليم اللغة اليابانية. وهذا المزيج المثالي من المدرِّسين يتيح لنا تقديم تعليم متميز يجمع بين الدقة اللغوية والتواصل الفعال مع الطلاب.

              </p>
            </li>

            <li className="academy mb-4">
              <h2>2. مرونة في التعلم: </h2>
              <p>
              في <span className="academySpan"> أكاديمية اللغة اليابانية </span>
              نفهم أن الطلاب لديهم جداول زمنية مختلفة، لذا نقدم مرونة في اختيار مواعيد الدروس بما يتناسب مع ظروفهم. فسواءً كنت تفضل التعلم في الصباح أو المساء، يمكنك ضبط جدولك الدراسي بما يتناسب مع احتياجاتك.

              </p>
            </li>

            <li className="academy mb-4">
              <h2>3. موارد تعليمية شاملة: </h2>
              <p>
              بالإضافة إلى الدروس المباشرة، يحصل الطلاب في <span className="academySpan"> أكاديمية اللغة اليابانية </span> على مجموعة واسعة من المواد التعليمية مثل الكتب الإلكترونية، والملفات الصوتية، والفيديوهات التعليمية، والتطبيقات التفاعلية التي تساعدهم على ممارسة اللغة في أي وقت.

              </p>
            </li>

            <li className="academy mb-4">
              <h2>4. بيئة تعليمية داعمة:</h2>
              <p>
              نسعى في <span className="academySpan"> أكاديمية اللغة اليابانية </span>
              إلى توفير بيئة تعليمية محفزة، تشجع الطلاب على المشاركة وطرح الأسئلة دون أي تردد. ونقوم بالاهتمام بكل طالب بشكل فردي، ونعمل على تقديم الدعم اللازم له لتحقيق النجاح.

              </p>
            </li>

            <li className="academy mb-4">
              <h2>5. شبكة تواصل مع المتعلمين والخبراء: </h2>
              <p>
              من خلال <span className="academySpan"> أكاديمية اللغة اليابانية، </span> يتاح للطلاب التواصل مع متعلمين آخرين من مختلف أنحاء العالم العربي، بالإضافة إلى الخبراء والمدرسين اليابانيين والعرب على حد السواء. وهذا يساهم في بناء مجتمع تعليمي داعم يمكن للطلاب فيه تبادل الخبرات والتجارب مع الآخرين.

              </p>
            </li>
          </ul>
        </div>
      </div>
    </>
  );
}
