import "./Header.css";
import Logo from "../../assets/Logo/الشعار-2-png.png";
import img_header from "../../assets/Ai_img/_c44c06cf-5421-4193-b9bb-cd39a86e679f.jpg";
import img_what_we_do from '../../assets/imgheader/_dcdcbe88-4c28-4699-bb82-1d2754efe109.jpg'
import img_why_we_choos from '../../assets/imgheader/_993a5416-0b18-4ddb-869a-a5b99532ffe5.jpg'
// import learn_img from '../../assets/imgheader/R (1).jpg'
export default function Header() {
  return (
    <>
      <div className="container Header">
        <div className="academy pb-4 pt-4 mt-4 left">
          <div className="row Header_revers">
            <div className="col-lg-6">
              <img className="w-100" src={img_header} alt="" />
            </div>
            <div className="col-lg-6">
              <div className="acadeny_logo mb-4 ">
                <h2 className=" left fw-bold">أكاديمية اللغة اليابانية</h2>
              </div>
              {/* <h2 className="title_academy mb-3">التعريف بالأكاديمية:</h2> */}
              <div className="details">
                <span className="fw-bold">
                  {" "}
                  مرحبًا بكم في أكاديمية اللغة اليابانية،{" "}
                </span>
                المنصة التعليمية الرائدة لتعلم اللغة اليابانية للناطقين باللغة
                العربية. نقدم لكم تجربة تعليمية تفاعلية وفريدة تمكنكم من تعلم
                اللغة اليابانية من خلال مجموعة متنوعة من الدروس والأنشطة، مدعومة
                بأحدث التقنيات التعليمية وطرق التدريس المتقدمة. ما يميزنا في
                أكاديميتنا هو فريق التدريس المتعدد الثقافات الذي يضم ناطقين
                أصليين باللغتين اليابانية والعربية، مما يوفر لكم تعلمًا ممتعًا
                وسلسًا يجمع بين الدقة اللغوية والتواصل الثقافي، ونوفر لكم بيئة
                تعليمية مخصصة تساعدكم على تحقيق أهدافكم اللغوية والثقافية.
              </div>
            </div>
          </div>
        </div>
        <div className="academy mt-5 mb-5 right">
          <h2 className="title_academy mb-3">رؤيتنا:</h2>
          <div className="details">
            تأسست أكاديمية اللغة اليابانية لتكون جسرًا يربط بين العالم العربي
            واليابان من خلال اللغة والثقافة. فنحن نؤمن أن تعلم اللغة ليس مجرد
            إتقان المفردات والقواعد، بل هو نافذة لفهم الثقافات والحضارات
            المختلفة. ومن هنا، جاءت رؤيتنا في تقديم تعليم شامل يمزج بين التعليم
            اللغوي والتواصل الثقافي، بحيث يصبح الطلاب قادرين على استخدام اللغة
            اليابانية بشكل فعال في حياتهم اليومية والعملية. وبناء جسر ثقافي بين
            العالم العربي واليابان من خلال تعليم اللغة اليابانية بطريقة مبتكرة،
            ومتدرجة، وشاملة. ونسعى إلى تمكين الطلاب من التواصل بثقة واحترافية
            باللغة اليابانية في مختلف مجالات الحياة، سواء كانت أكاديمية، أو
            مهنية، أو حتى ترفيهية. وفي أكاديمية اللغة اليابانية نؤمن بأن اللغة
            ليست مجرد أداة تواصل، بل هي مفتاح لفهم ثقافات جديدة وتوسيع آفاق
            الفكر.
          </div>
        </div>

        <div className="academy mt-5 mb-5 right">
          <h2 className="title_academy mb-3">رسالتنا:</h2>
          <div className="details">
            رسالتنا هي توفير تعليم عالي الجودة يمكِّن جميع المتعلمين من اكتساب
            اللغة اليابانية بفعالية، مع فهم عميق للثقافة اليابانية. ونهدف إلى أن
            نصبح وجهة أساسية لكل من يسعى لتعلم اللغة اليابانية في العالم العربي.
            ونحرص على أن يكون التعليم في أكاديميتنا ليس فقط تفاعليًا وممتعًا، بل
            أيضًا مبنيًا على أسس علمية وتربوية مدروسة تضمن الفهم العميق والتطبيق
            السليم للغة. وفي أكاديمية اللغة اليابانية، نؤمن أن إتقان اللغة
            اليابانية سيفتح أمامك أبوابًا واسعة من الفرص سواء في مجالات العمل،
            أو الدراسة، أو حتى التواصل الشخصي. وتعلم اللغة اليابانية ليس مجرد
            اكتساب مهارات جديدة، بل هو رحلة لاكتشاف عالم جديد مليء بالإثارة
            والتحديات.
          </div>
        </div>
        <div className="what_we_do ">
          <h2 className="fw-bold text-center mb-4">
            ماذا نقدم في أكاديمية اللغة اليابانية؟
          </h2>
          <img className="w-75 m-auto d-flex mb-4" src={img_what_we_do} alt="" />
          <ul className="ps-0">
            <li className="academy mb-4">
              <h2>1. دورات تعليمية شاملة: </h2>
              <p>
                تقدم أكاديميتنا دورات تعليمية متنوعة تناسب جميع المستويات، بدءًا
                من المبتدئين الذين لا يملكون أي معرفة سابقة باللغة اليابانية
                وصولًا إلى المتعلمين المتقدمين الذين يرغبون في تحسين مهاراتهم
                اللغوية. وتعتمد الدورات على منهجيات تدريس حديثة ومتطورة تجمع بين
                التعلم الذاتي والتفاعل المباشر مع المدرسين.
              </p>
            </li>
            <li className="academy mb-4">
              <h2>2. تدريس تفاعلي عبر الإنترنت: </h2>
              <p>
                نستخدم أحدث الأدوات والمنصات التعليمية لتقديم دروس تفاعلية عبر
                الإنترنت. يمكن للطلاب الانضمام إلى الحصص الافتراضية من أي مكان
                في العالم، والمشاركة في نقاشات وأنشطة مباشرة مع معلمين ناطقين
                أصليين باللغتين اليابانية والعربية، مما يعزز التفاعل والتطبيق
                الفعلي للغة.
              </p>
            </li>
            <li className="academy mb-4">
              <h2>3. برنامج متكامل للتعلم الثقافي: </h2>
              <p>
                إلى جانب تعليم اللغة، نقدم لطلابنا مواد وأنشطة تساعدهم على فهم
                الثقافة والعادات والتقاليد اليابانية. وهذا البرنامج الثقافي يعزز
                من قدرة الطلاب على التواصل بفعالية مع المجتمع الياباني ويفتح لهم
                آفاقًا أوسع لفهم المجتمع والثقافة اليابانية.
              </p>
            </li>
            <li className="academy mb-4">
              <h2>4. أساليب تدريس مبتكرة: </h2>
              <p>
                نحرص على استخدام أساليب تدريس حديثة تعتمد على التكنولوجيا
                المتقدمة مثل التعلم التكيفي، والألعاب التعليمية، والتطبيقات
                التفاعلية. وهذه الأساليب تجعل عملية التعلم أكثر متعة وفعالية،
                وتساعد الطلاب على تحسين مهاراتهم في وقت قصير.
              </p>
            </li>
            <li className="academy mb-4">
              <h2>5. دروس خصوصية وجماعية: </h2>
              <p>
                نوفر خيارات متعددة من الدروس، سواء كنت تفضل التعلم ضمن مجموعة أو
                تحتاج إلى دروس خصوصية مع مدرس متخصص. تتناسب هذه الخيارات مع
                احتياجات كل طالب، سواء كان الهدف هو اكتساب المهارات الأساسية أو
                التحضير للامتحانات الرسمية مثل اختبار الكفاءة في اللغة اليابانية
                (JLPT) وغيره.
              </p>
            </li>
          </ul>
        </div>
        <div className="why_we_choose">
          <h2 className="fw-bold text-center">
            لماذا تختار أكاديمية اللغة اليابانية؟
          </h2>
          <img className="w-75 m-auto d-flex mb-4" src={img_why_we_choos} alt="" />
          <ul className="ps-0">
            <li className="academy mb-4">
              <h2>1. فريق تدريس متخصص:</h2>
              <p>
                يضم فريقنا مدرِّسين ناطقين أصليين باليابانية، بالإضافة إلى
                مدرِّسين ناطقين باللغة العربية ذوي خبرة في تعليم اللغة
                اليابانية. وهذا المزيج المثالي من المدرِّسين يتيح لنا تقديم
                تعليم متميز يجمع بين الدقة اللغوية والتواصل الفعال مع الطلاب.
              </p>
            </li>

            <li className="academy mb-4">
              <h2>2. مرونة في التعلم: </h2>
              <p>
                نفهم أن الطلاب لديهم جداول زمنية مختلفة، لذا نقدم مرونة في
                اختيار مواعيد الدروس بما يتناسب مع ظروفهم. سواء كنت تفضل التعلم
                في الصباح أو المساء، يمكنك ضبط جدولك الدراسي بما يتناسب مع
                احتياجاتك.
              </p>
            </li>

            <li className="academy mb-4">
              <h2>3. موارد تعليمية شاملة: </h2>
              <p>
                بالإضافة إلى الدروس المباشرة، يحصل الطلاب على مجموعة واسعة من
                الموارد التعليمية مثل الكتب الإلكترونية، والملفات الصوتية،
                والفيديوهات التعليمية، والتطبيقات التفاعلية التي تساعدهم على
                ممارسة اللغة في أي وقت.
              </p>
            </li>

            <li className="academy mb-4">
              <h2>4. بيئة تعليمية داعمة:</h2>
              <p>
                نسعى لتوفير بيئة تعليمية محفزة تشجع الطلاب على المشاركة
                والاستفسار دون أي تردد. ونحن نهتم بكل طالب بشكل فردي، ونعمل على
                تقديم الدعم اللازم له لتحقيق النجاح.
              </p>
            </li>

            <li className="academy mb-4">
              <h2>5. شبكة تواصل مع المتعلمين والخبراء: </h2>
              <p>
                : من خلال الأكاديمية، يتاح للطلاب التواصل مع متعلمين آخرين من
                مختلف أنحاء العالم العربي، بالإضافة إلى الخبراء والمدرسين
                اليابانيين والعرب على حد السواء. وهذا يساهم في بناء مجتمع تعليمي
                داعم يمكن للطلاب فيه تبادل الخبرات والتجارب.
              </p>
            </li>
          </ul>
        </div>
      </div>
    </>
  );
}
