import "./About_pay.css";
import { RxBorderSolid } from "react-icons/rx";

export default function About_pay() {
  return (
    <>
      <div className="Allcontent pb-5 pt-5">
        <div className="container Aboutiso text-center">
          <div className="row">
            <div className="Howregister col-xl-6 col-lg-6">
              <h4 className="mb-4 fw-bold">سياسية دفع الرسوم واستردادها</h4>
              <p>
                لأكاديمية اللغة العربية حسابات في عدة دول حول العالم فضلا عن
                إمكانية الدفع في باي بال و وايز وكويت ترك في تركيا
              </p>
              <ul>
                <li> <RxBorderSolid />
                  بعد مقابلة تحديد المستوى وحضور الحصص التجريبية يثبت الطالب
                  التسجيل بدفع الرسوم لشهر مقدماً أو أكثر
                </li>
                <li> <RxBorderSolid />الدفع في بداية كل شهر ميلادي.</li>
                <li> <RxBorderSolid />يتحمل الطالب رسوم التحويل إن وجدت.</li>
                <li> <RxBorderSolid />
                  يمكن للطالب إيقاف التسجيل لمدة أسبوع أو أكثر في الدروس
                  الفردية.
                </li>
                <li> <RxBorderSolid />
                  لا يمكن إيقاف التسجيل في الدروس الجماعية لاستمرار بقية الطلاب
                  في الدراسة.
                </li>
                <li> <RxBorderSolid />
                  لا تحسم أجور أيام العطل الرسمية مثل عيد الفطر وعيد الأضحى.
                </li>
                <li> <RxBorderSolid />
                  يتحمل الطالب مسؤولية غيابه عن الدروس، ولكن يمكنه الاستفادة من
                  مزية إيقاف التسجيل في الدروس الفردية فقط.
                </li>
              </ul>
            </div>
            <div className="Registertrack col-xl-6 col-lg-6">
              <h4 className="fw-bold mb-4">
                النظام الدراسي في أكاديمية اللغة العربية
              </h4>
              <p>
                تعتمد أكاديمية اللغة العربية نظاما تعليمياً مميزاً لتقدم اللغة
                العربية بأبسط أسلوب لأبنائها بعيداً عن التعقيد والتقعر.
              </p>
              <ul>
                <li>
                  {" "}
                  وقد وُضع هذا البرنامج بناء على دراسات الخبراء والمتخصصين في
                  تعليم اللغة العربية. حيث يهدف إلى تمكين المهارات الأساسية
                  لمتحدث اللغة العربية الأصلي، سواء أكان يقيم في بلاد عربية أم
                  يقيم في بلاد أجنبية.
                </li>
                <li>
                  ويهدف هذا البرنامج إلى تقديم اللغة العربية بطريقة تكاملية بحيث
                  تتكامل مهارات: الاستماع، والتحدث باللغة العربية الفصحى،
                  والقراءة السليمة، فضلاً عن الكتابة السليمة.
                </li>
                <li>
                  إضافة إلى تعليم غير العرب، ودورات القرآن الكريم، كما تأخذ على
                  عاتقها تطوير المعلمين والآباء والأمهات في تعليم اللغة العربية
                  لأبنائهم في تعليم اللغة العربية من خلال دورات مميزة ومتخصصة.
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
