import './Register_header.css'
export default function Register_header() {
  return (
    <>
    <div className="container Register">
        <h3>طريقة التسجيل:</h3>
        <p>عملية التسجيل في أكاديميتنا بسيطة ومرنة، تشمل الخطوات التالية:</p>
        <ul className='mt-5'>
            <li className='step1 left item1'>
                <h4>إنشاء حساب مجاني:</h4>
                <p>قم بتعبئة نموذج التسجيل باستخدام بريدك الإلكتروني أو حسابات التواصل الاجتماعي. بعد ذلك، ستتلقى رسالة تأكيد بالبريد الإلكتروني.</p>
            </li>
            <li className='step2 top item2'>
                <h4> اختبار تحديد المستوى:</h4>
                <p>خذ اختبار تحديد المستوى المجاني عبر الإنترنت لتحديد مستوى دراستك المناسب.</p>
            </li>
            <li className='step3 right item3'>
                <h4> اختيار الدورة المناسبة:</h4>
                <p>بناءً على نتائج اختبار تحديد المستوى، يمكنك اختيار الدورة التعليمية الأنسب وبدء التسجيل.</p>
            </li>
            <li className='step4 left item4'>
                <h4> إتمام عملية الدفع:</h4>
                <p>أتمم عملية الدفع من خلال وسائل الدفع الإلكترونية المتاحة (بطاقات ائتمان، PayPal، تحويل بنكي).</p>
            </li>
            <li className='step5 right item5'>
                <h4> الوصول إلى الدروس:</h4>
                <p>بعد الدفع، ستحصل على وصول فوري إلى منصة الدروس حيث يمكنك البدء في التعلم على الفور.</p>
            </li>

        </ul>
    </div>
    </>
  )
}
